function node(name, child){
	this.name=name;
	this.child=child;
}

function city_dataHierarchy(){
	
	
	// 鄉鎮類別
	var	Yilan_County=new Array(); var i=0;
	    Yilan_County[i++]=new node("");
		Yilan_County[i++]=new node("三星鄉", ["","員山村","天山村","天福村","雙賢村","人和村","義德村","集慶村","月眉村","拱照村","大隱村","行健村","萬德村","貴林村","萬富村","大義村","尚武村","大洲村","尾塹村"]);																		
		Yilan_County[i++]=new node("大同鄉", ["","寒溪村","崙埤村","松羅村","復興村","樂水村","太平村","四季村","南山村","茂安村","英士村"]);																										
		Yilan_County[i++]=new node("冬山鄉", ["","武淵村","珍珠村","補城村","三奇村","大興村","東城村","香和村","南興村","冬山村","安平村","太和村","八寶村","丸山村","中山村","順安村","永美村","群英村","清溝村","鹿埔村","得安村","廣興村","廣安村","柯林村","大進村"]);													
		Yilan_County[i++]=new node("壯圍鄉", ["","吉祥村","美福村","新南村","東港村","復興村","過嶺村","永鎮村","忠孝村","古亭村","功勞村","美城村","新社村","大福村","古結村"]);																						
		Yilan_County[i++]=new node("宜蘭市", ["","大新里","新東里","泰山里","七結里","擺厘里","中興里","成功里","神農里","民權里","進士里","南橋里","建業里","南津里","凱旋里","黎明里","東村里","延平里","七張里","慈安里","新民里","東門里","小東里","菜園里","孝廉里","新生里","茭白里","北津里","梅洲里","北門里","中山里","西門里","南門里","負郭里","民族里","建軍里","思源里","文化里","復興里"]);
		Yilan_County[i++]=new node("南澳鄉", ["","南澳村","碧候村","東岳村","金岳村","武塔村","澳花村","金洋村"]);																														
		Yilan_County[i++]=new node("員山鄉", ["","員山村","尚德村","惠好村","七賢村","深溝村","蓁巷村","內城村","中華村","永和村","頭分村","枕山村","同樂村","湖東村","逸仙村","湖北村","湖西村"]);																					
		Yilan_County[i++]=new node("頭城鎮", ["","石城里","大里里","大溪里","合興里","更新里","外澳里","港口里","武營里","大坑里","城東里","城北里","城西里","城南里","竹安里","新建里","拔雅里","福成里","金面里","金盈里","頂埔里","下埔里","中崙里","二城里","龜山里"]);													
		Yilan_County[i++]=new node("礁溪鄉", ["","白雲村","玉石村","德陽村","大忠村","大義村","六結村","二龍村","時潮村","玉田村","三民村","林美村","白鵝村","玉光村","光武村","吳沙村","龍潭村","二結村","匏崙村"]);																		
		Yilan_County[i++]=new node("羅東鎮", ["","大新里","東安里","新群里","羅莊里","南昌里","南豪里","成功里","仁德里","漢民里","西安里","北成里","賢文里","公正里","集祥里","信義里","竹林里","仁愛里","樹林里","國華里","維揚里","開明里","中山里","仁和里"]);														
		Yilan_County[i++]=new node("蘇澳鎮", ["","龍德里","頂寮里","永榮里","存仁里","港邊里","隘丁里","新城里","聖湖里","蘇西里","蘇北里","蘇南里","蘇東里","長安里","永光里","永春里","永樂里","南安里","南正里","南成里","南興里","南寧里","南建里","東澳里","南強里","朝陽里","聖愛里"]);										

	var	Keelung_City=new Array(); var i=0;
		Keelung_City[i++]=new node("");
		Keelung_City[i++]=new node("七堵區", ["","長安里","實踐里","堵北里","堵南里","百福里","六堵里","泰安里","正明里","正光里","長興里","永平里","富民里","永安里","友一里","瑪南里","八德里","自強里","友二里","瑪西里","瑪東里"]);
		Keelung_City[i++]=new node("中山區", ["","新建里","安民里","西榮里","安平里","中山里","西華里","民治里","中興里","仁正里","西定里","健民里","西康里","和平里","仙洞里","居仁里","通明里","德和里","通化里","太白里","和慶里","文化里","中和里","德安里","協和里"]);
		Keelung_City[i++]=new node("中正區", ["","德義里","正義里","義重里","港通里","中船里","信義里","砂子里","正船里","新富里","入船里","新豐里","真砂里","中砂里","砂灣里","正砂里","建國里","八斗里","長潭里","碧砂里","中濱里","中正里","正濱里","海濱里","和憲里","社寮里","平寮里"]);
		Keelung_City[i++]=new node("仁愛區", ["","英仁里","育仁里","龍門里","吉仁里","德厚里","曲水里","獅球里","誠仁里","兆連里","福仁里","書院里","光華里","崇文里","虹橋里","水錦里","林泉里","智仁里","博愛里","文安里","同風里","花崗里","和明里","明德里","朝棟里","忠勇里","玉田里","仁德里","新店里","文昌里"]);
		Keelung_City[i++]=new node("安樂區", ["","鶯安里","壯觀里","鶯歌里","七賢里","三民里","六合里","嘉仁里","樂一里","五福里","安和里","四維里","永康里","定邦里","慈仁里","長樂里","干城里","定國里","西川里","外寮里","興寮里","新西里","武崙里","中崙里","新崙里","內寮里"]);
		Keelung_City[i++]=new node("信義區", ["","智慧里","智誠里","禮東里","禮儀里","孝岡里","孝深里","仁壽里","仁義里","義昭里","義幸里","義民里","東安里","義和里","信綠里","東信里","東光里","孝德里","東明里","孝賢里","孝忠里"]);
		Keelung_City[i++]=new node("暖暖區", ["","暖東里","碇祥里","暖西里","碇內里","碇安里","碇和里","暖暖里","暖同里","過港里","八南里","八堵里","八中里","八西里"]);

	var	Taipei_City=new Array(); var i=0;
		Taipei_City[i++]=new node("");
		Taipei_City[i++]=new node("士林區", ["","明勝里","富光里","福華里","福順里","承德里","百齡里","葫蘆里","前港里","葫東里","福中里","社新里","義信里","仁勇里","福德里","社子里","社園里","永倫里","後港里","福佳里","福林里","舊佳里","福志里","德華里","名山里","德行里","忠誠里","岩山里","聖山里","蘭雅里","翠山里","臨溪里","蘭興里","福安里","富洲里","天祿里","永福里","三玉里","天福里","天壽里","芝山里","天玉里","天山里","天和里","東山里","新安里","公館里","天母里","溪山里","陽明里","平等里","菁山里"]);
		Taipei_City[i++]=new node("大同區", ["","建明里","建泰里","玉泉里","建功里","永樂里","朝陽里","星明里","光能里","雙連里","大有里","延平里","民權里","南芳里","景星里","隆和里","蓬萊里","斯文里","揚雅里","國順里","國慶里","至聖里","鄰江里","保安里","老師里","重慶里"]);
		Taipei_City[i++]=new node("大安區", ["","黎元里","黎和里","大學里","學府里","黎孝里","古風里","芳和里","虎嘯里","臥龍里","龍淵里","龍坡里","龍泉里","古莊里","群英里","群賢里","法治里","龍生里","全安里","錦華里","錦安里","臨江里","龍陣里","龍安里","龍雲里","新龍里","錦泰里","通化里","通安里","義安里","住安里","龍圖里","龍門里","福住里","永康里","光明里","光信里","敦煌里","敦安里","德安里","仁慈里","和安里","民炤里","正聲里","建倫里","仁愛里","義村里","車層里","昌隆里","誠安里","建安里","光武里","華聲里","民輝里"]);
		Taipei_City[i++]=new node("中山區", ["","埤頭里","朱崙里","正守里","力行里","朱園里","興亞里","正義里","正得里","復華里","康樂里","龍洲里","朱馥里","民安里","中吉里","中央里","中原里","中山里","聚盛里","江山里","中庄里","江寧里","松江里","新生里","聚葉里","新福里","恆安里","晴光里","下埤里","行仁里","行政里","行孝里","新喜里","集英里","大佳里","新庄里","圓山里","永安里","金泰里","成功里","劍潭里","北安里","大直里"]);
		Taipei_City[i++]=new node("中正區", ["","水源里","富水里","文盛里","林興里","網溪里","河堤里","頂東里","板溪里","螢圃里","螢雪里","永昌里","永功里","忠勤里","龍興里","南福里","龍光里","廈安里","新營里","龍福里","南門里","愛國里","文祥里","三愛里","文北里","建國里","幸市里","東門里","幸福里","梅花里","黎明里","光復里"]);
		Taipei_City[i++]=new node("內湖區", ["","行善里","週美里","蘆洲里","石潭里","五分里","南湖里","明湖里","葫洲里","湖元里","樂康里","東湖里","安湖里","湖興里","寶湖里","瑞光里","康寧里","瑞陽里","金湖里","紫雲里","紫陽里","港墘里","紫星里","港都里","清白里","內湖里","西湖里","麗山里","金龍里","秀湖里","湖濱里","港富里","安泰里","港華里","西康里","西安里","大湖里","金瑞里","內溝里","碧山里"]);
		Taipei_City[i++]=new node("文山區", ["","樟新里","老泉里","樟腳里","樟文里","樟樹里","順興里","指南里","樟林里","忠順里","試院里","木新里","明義里","景行里","華興里","明興里","景美里","木柵里","景東里","興家里","政大里","景慶里","景華里","興福里","景仁里","興得里","興安里","興業里","萬有里","興光里","萬隆里","萬芳里","興豐里","萬祥里","萬興里","興邦里","萬和里","萬美里","萬盛里","興旺里","萬年里","興泰里","興昌里","博嘉里"]);
		Taipei_City[i++]=new node("北投區", ["","建民里","文林里","石牌里","洲美里","福興里","吉慶里","榮光里","裕民里","立賢里","尊賢里","吉利里","振華里","永明里","榮華里","立農里","關渡里","東華里","八仙里","永欣里","清江里","中央里","大同里","奇岩里","溫泉里","長安里","豐年里","中庸里","一德里","永和里","林泉里","文化里","智仁里","桃源里","中心里","中和里","開明里","稻香里","秀山里","湖山里","泉源里","大屯里","湖田里"]);
		Taipei_City[i++]=new node("松山區", ["","中崙里","福成里","敦化里","吉仁里","復源里","復建里","復盛里","新聚里","吉祥里","復勢里","美仁里","慈祐里","東勢里","東光里","安平里","中正里","中華里","龍田里","自強里","鵬程里","松基里","東昌里","介壽里","富泰里","民有里","東榮里","三民里","富錦里","新益里","新東里","民福里","精忠里","莊敬里"]);
		Taipei_City[i++]=new node("信義區", ["","黎安里","黎忠里","泰和里","黎平里","惠安里","六合里","黎順里","雙和里","景勤里","嘉興里","三張里","景新里","景聯里","三犁里","中興里","松友里","松隆里","正和里","西村里","安康里","國業里","大仁里","中坡里","廣居里","興隆里","中行里","富台里","松光里","長春里","興雅里","大道里","永春里","四維里","五全里","六藝里","敦厚里","五常里","新仁里","雅祥里","四育里","永吉里"]);
		Taipei_City[i++]=new node("南港區", ["","九如里","仁福里","百福里","舊莊里","鴻福里","成福里","萬福里","中研里","聯成里","合成里","新光里","玉成里","新富里","中南里","東明里","東新里","西新里","重陽里","南港里","三重里"]);
		Taipei_City[i++]=new node("萬華區", ["","榮德里","華中里","興德里","日祥里","銘德里","保德里","孝德里","壽德里","忠貞里","騰雲里","全德里","凌霄里","錦德里","忠德里","和德里","新和里","日善里","新安里","新忠里","和平里","雙園里","綠堤里","頂碩里","華江里","糖[部]里","富福里","仁德里","福音里","富民里","新起里","柳鄉里","青山里","西門里","菜園里","萬壽里","福星里"]);

	
	var	Xinbai_City =new Array(); var i=0;
		Xinbai_City[i++]=new node("");
		Xinbai_City[i++]=new node("八里區", ["","長坑里","龍源里","荖阡里","下罟里","舊城里","訊塘里","米倉里","頂罟里","大崁里","埤頭里"]);
		Xinbai_City[i++]=new node("三芝區", ["","八賢里","福德里","圓山里","後厝里","錫板里","埔頭里","埔坪里","橫山里","茂長里","古庄里","新庄里","興華里","店子里"]);
		Xinbai_City[i++]=new node("三重區", ["","五谷里","德厚里","成功里","福民里","福德里","中興里","光正里","同安里","福祉里","永春里","谷王里","同慶里","大安里","重明里","仁義里","光明里","平和里","吉利里","菜寮里","忠孝里","中正里","中民里","光輝里","過田里","光田里","光陽里","大同里","福利里","仁德里","光榮里","清和里","重新里","福星里","田安里","中山里","錦田里","永興里","正德里","錦通里","國隆里","頂崁里","三民里","文化里","大園里","重陽里","田心里","大德里","光華里","錦安里","開元里","正義里","中央里","民生里","正安里","長生里","長元里","自強里","雙園里","長江里","福田里","長安里","博愛里","二重里","田中里","六福里","安慶里","長泰里","幸福里","長福里","介壽里","福安里","六合里","錦江里","三安里","信安里","立德里","奕壽里","萬壽里","培德里","秀江里","永煇里","大有里","龍門里","永發里","厚德里","龍濱里","永德里","尚德里","永豐里","維德里","永吉里","永安里","崇德里","瑞德里","永順里","順德里","承德里","永福里","永盛里","福隆里","福樂里","永清里","慈福里","溪美里","慈生里","慈愛里","慈惠里","五常里","慈祐里","五順里","仁忠里","仁華里","慈化里","五福里","富福里","五華里","富華里","碧華里","富貴里"]);
		Xinbai_City[i++]=new node("三峽區", ["","五寮里","有木里","插角里","金圳里","添福里","二鬮里","嘉添里","大埔里","竹崙里","弘道里","中正里","八張里","介壽里","安溪里","中埔里","三峽里","秀川里","礁溪里","溪南里","永[館]里","成福里","溪東里","鳶山里","龍埔里","龍學里","龍恩里","溪北里","安坑里"]);
		Xinbai_City[i++]=new node("土城區", ["","祖田里","頂新里","頂福里","頂埔里","永寧里","土城里","清化里","沛陂里","大安里","員信里","埤塘里","清和里","員仁里","長風里","青山里","員林里","清水里","員福里","柑林里","學士里","廷寮里","永豐里","永富里","明德里","學府里","中正里","金城里","日和里","樂利里","[峰]廷里","廣福里","日新里","埤林里","延和里","清溪里","學成里","青雲里","廣興里","安和里","延吉里","延祿里","裕生里","貨饒里","復興里","平和里","延壽里","瑞興里"]);
		Xinbai_City[i++]=new node("中和區", ["","華新里","頂南里","橫路里","華南里","正南里","內南里","福南里","崇南里","忠孝里","錦和里","東南里","景南里","外南里","壽南里","錦昌里","景本里","興南里","錦盛里","秀峰里","吉興里","秀士里","復興里","景新里","中興里","灰[瑤]里","景福里","德行里","秀水里","錦中里","秀成里","秀明里","景平里","秀景里","秀義里","和興里","仁和里","中正里","中山里","秀仁里","秀山里","正行里","嘉慶里","建和里","安順里","壽德里","秀福里","景安里","安和里","新南里","明德里","南山里","景文里","力行里","宜安里","嘉穗里","文元里","泰安里","連城里","明穗里","民安里","信和里","漳和里","安平里","清穗里","自強里","國華里","廟美里","民享里","枋寮里","連和里","安樂里","國光里","冠穗里","嘉新里","中安里","安穗里","福和里","碧河里","平河里","瓦[瑤]里","民有里","福真里","民生里","福善里","積穗里","德穗里","福祥里","佳和里","瑞穗里","福美里","員山里","員富里","中原里"]);
		Xinbai_City[i++]=new node("五股區", ["","德泰里","貿商里","福德里","水碓里","興珍里","德音里","更寮里","五股里","陸一里","五福里","民義里","六福里","成功里","成州里","成德里","成泰里","集賢里","集福里","五龍里","觀音里"]);
		Xinbai_City[i++]=new node("平溪區", ["","東勢里","白石里","薯榔里","石底里","菁桐里","平湖里","平溪里","十分里","嶺腳里","南山里","望古里","新寮里"]);
		Xinbai_City[i++]=new node("永和區", ["","智光里","民本里","民富里","民生里","民權里","民族里","民治里","秀得里","秀元里","潭安里","民樂里","雙和里","永元里","潭墘里","秀林里","得和里","安和里","秀朗里","秀成里","永安里","水源里","秀和里","保平里","福和里","永樂里","永貞里","店街里","永福里","協和里","河濱里","大新里","光明里","福林里","和平里","豫溪里","前溪里","竹林里","信義里","保安里","正興里","永興里","保順里","中溪里","後溪里","桂林里","中興里","大同里","勵行里","上溪里","仁愛里","新生里","上林里","下溪里","復興里","忠義里","文化里","光復里","頂溪里","永成里","網溪里","新[部]里","河堤里"]);
		Xinbai_City[i++]=new node("石門區", ["","草里里","德茂里","老梅里","山溪里","茂林里","石門里","乾華里","尖鹿里","富基里"]);
		Xinbai_City[i++]=new node("石碇區", ["","永安里","格頭里","彭山里","烏塗里","石碇里","潭邊里","豐田里","豐林里","永定里","中民里","隆盛里","光明里"]);
		Xinbai_City[i++]=new node("汐止區", ["","宜興里","東勢里","福山里","橫科里","白雲里","文化里","樟樹里","自強里","秀山里","復興里","忠孝里","環河里","大同里","福安里","中興里","秀峰里","東山里","福德里","興福里","智慧里","禮門里","厚德里","信望里","新昌里","茄苳里","義民里","康福里","仁德里","北山里","城中里","崇德里","北峰里","金龍里","山光里","保安里","橋東里","保新里","建成里","湖蓮里","江北里","長安里","忠山里","湖光里","保長里","鄉長里","湖興里","拱北里","八連里","長青里","烘內里"]);
		Xinbai_City[i++]=new node("坪林區", ["","石[曹]里","大林里","水德里","坪林里","粗窟里","上德里","漁光里"]);
		Xinbai_City[i++]=new node("板橋區", ["","溪福里","溪洲里","堂春里","溪北里","廣福里","和平里","華德里","五權里","信義里","重慶里","福安里","崑崙里","仁愛里","成和里","龍安里","大豐里","廣德里","中山里","華貴里","大安里","華東里","復興里","聚安里","福星里","華興里","福德里","華福里","國泰里","後埔里","新興里","僑中里","福祿里","景星里","民族里","鄉雲里","流芳里","赤松里","留侯里","大觀里","歡園里","湳興里","光華里","挹秀里","海山里","東安里","深丘里","黃石里","福壽里","光榮里","長安里","自強里","居仁里","福丘里","民生里","自立里","民安里","正泰里","香丘里","民權里","東丘里","西安里","長壽里","建國里","香雅里","富貴里","漢生里","九如里","國光里","玉光里","新民里","社後里","港德里","公[館]里","光仁里","百壽里","華中里","埔墘里","金華里","介壽里","廣新里","莊敬里","浮洲里","港尾里","新生里","香社里","埤墘里","雙玉里","光復里","華江里","幸福里","忠誠里","新埔里","文德里","永安里","陽明里","振興里","莒光里","華翠里","聯翠里","德翠里","振義里","新翠里","明翠里","朝陽里","港嘴里","龍翠里","新海里","忠翠里","仁翠里","吉翠里","文化里","文聖里","松柏里","福翠里","滿翠里","松翠里","純翠里","江翠里","嵐翠里","中正里","懷翠里","青翠里","文翠里","宏翠里","溪頭里","柏翠里"]);
		Xinbai_City[i++]=new node("林口區", ["","麗林里","麗園里","東勢里","仁愛里","林口里","西林里","南勢里","菁湖里","湖南里","東林里","中湖里","湖北里","頂福里","嘉寶里","下福里","瑞平里","太平里"]);
		Xinbai_City[i++]=new node("金山區", ["","六股里","清泉里","兩湖里","三界里","萬壽里","西湖里","永興里","五湖里","和平里","大同里","金美里","重和里","美田里","豐漁里","磺港里"]);
		Xinbai_City[i++]=new node("泰山區", ["","貴和里","貴賢里","新明里","貴子里","泰友里","明志里","義學里","義仁里","全興里","同興里","福興里","同榮里","福泰里","山腳里","楓樹里","大科里","黎明里"]);
		Xinbai_City[i++]=new node("烏來區", ["","福山里","信賢里","孝義里","烏來里","忠治里"]);
		Xinbai_City[i++]=new node("貢寮區", ["","吉林里","龍崗里","福隆里","福連里","雙玉里","龍門里","貢寮里","仁里里","真理里","美豐里","和美里"]);
		Xinbai_City[i++]=new node("淡水區", ["","屯山里","民權里","福德里","竹圍里","民生里","八勢里","坪頂里","竿蓁里","草東里","長庚里","鄧公里","清文里","幸福里","永吉里","民安里","新生里","協元里","學府里","樹興里","中興里","新義里","北新里","文化里","水碓里","正德里","新民里","新興里","新春里","油車里","北投里","大庄里","水源里","沙崙里","埤島里","忠寮里","崁頂里","忠山里","義山里","蕃薯里","興仁里","中和里","賢孝里"]);
		Xinbai_City[i++]=new node("深坑區", ["","阿柔里","萬順里","深坑里","昇高里","埔新里","賴仲里","萬福里","土庫里"]);
		Xinbai_City[i++]=new node("新店區", ["","龜山里","廣興里","屈尺里","華城里","達觀里","吉祥里","玫瑰里","美城里","明城里","直潭里","塗潭里","小城里","日興里","青潭里","國校里","新店里","太平里","文中里","張南里","廣明里","雙坑里","安昌里","文明里","公崙里","香坡里","雙城里","美潭里","員潭里","中興里","新生里","下城里","長春里","頂城里","德安里","新德里","五[峰]里","中華里","百福里","柴埕里","中正里","仁愛里","張北里","百忍里","建國里","福民里","忠誠里","新安里","國豐里","福德里","中央里","百和里","明德里","安和里","大豐里","和平里","大同里","江陵里","寶安里","寶興里","永平里","永安里","中山里","寶福里","信義里","新和里","復興里","忠孝里","大鵬里","粗坑里"]);
		Xinbai_City[i++]=new node("新莊區", ["","光華里","光和里","光榮里","光正里","光明里","民有里","民本里","成德里","龍福里","民安里","龍安里","龍鳳里","八德里","民全里","西盛里","四維里","南港里","裕民里","萬安里","後港里","建安里","後德里","建福里","富國里","富民里","合鳳里","瓊林里","祥鳳里","豐年里","泰豐里","福營里","國泰里","海山里","雙鳳里","全安里","文衡里","文德里","忠孝里","全泰里","文聖里","興漢里","榮和里","立人里","立言里","恆安里","文明里","營盤里","立德里","立功里","中美里","思賢里","中和里","丹鳳里","思源里","立志里","中泰里","立泰里","中全里","中華里","自強里","自立里","立基里","中宏里","中誠里","自信里","仁愛里","仁義里","化成里","中港里","幸福里","信義里","中平里","昌隆里","中信里","昌明里","立廷里","昌信里","和平里","頭前里","昌平里","中隆里","中原里","福興里","福基里"]);
		Xinbai_City[i++]=new node("瑞芳區", ["","碩仁里","猴硐里","吉安里","弓橋里","光復里","爪[峰]里","龍興里","新峰里","東和里","福住里","上天里","銅山里","龍潭里","龍川里","瓜山里","永慶里","柑坪里","崇文里","龍鎮里","龍安里","新山里","頌德里","傑魚里","基山里","吉慶里","石山里","濂新里","南雅里","濂洞里","龍山里","海濱里","瑞濱里","鼻頭里","深澳里"]);
		Xinbai_City[i++]=new node("萬里區", ["","溪底里","崁[腳]里","北基里","中幅里","萬里里","雙興里","龜吼里","磺潭里","野柳里","大鵬里"]);
		Xinbai_City[i++]=new node("樹林區", ["","南園里","柑園里","西園里","東園里","北園里","彭厝里","太順里","彭興里","山佳里","中華里","彭福里","大同里","樂山里","東陽里","東昇里","和平里","中山里","樹南里","育英里","樹人里","樹西里","樹東里","樹北里","樹興里","樹福里","樹德里","東山里","保安里","坡內里","文林里","潭底里","圳福里","金寮里","光興里","圳安里","[槍]寮里","圳民里","三多里","三興里","三福里","圳生里","三龍里"]);
		Xinbai_City[i++]=new node("雙溪區", ["","泰平里","長源里","外柑里","共和里","雙溪里","魚行里","上林里","新基里","平林里","三港里","牡丹里","三貂里"]);
		Xinbai_City[i++]=new node("蘆洲區", ["","民和里","永安里","得仁里","延平里","九芎里","溪墘里","樹德里","中路里","長安里","中華里","恆德里","忠義里","仁復里","得勝里","光明里","永德里","仁義里","仁德里","光華里","永康里","鷺江里","保和里","中原里","玉清里","成功里","信義里","仁愛里","福安里","保佑里","忠孝里","永樂里","樓厝里","水湳里","南港里","復興里","正義里","水河里","保新里"]);
		Xinbai_City[i++]=new node("鶯歌區", ["","二甲里","二橋里","同慶里","南靖里","尖山里","東鶯里","中鶯里","建國里","南鶯里","永昌里","永吉里","北鶯里","西鶯里","鳳祥里","建德里","鳳鳴里","鳳福里","東湖里","大湖里","中湖里"]);

		
		var	Taoyuan_County=new Array(); var i=0;
		Taoyuan_County[i++]=new node("");
		Taoyuan_County[i++]=new node("八德區", ["","瑞德里","茄明里","永豐里","白鷺里","廣隆里","大正里","大宏里","大勇里","大強里","大仁里","龍友里","霄裡里","竹園里","大愛里","大漢里","高明里","福興里","廣德里","瑞興里","高城里","大福里","茄苳里","大忠里","大千里","大慶里","大同里","廣興里","大竹里","大成里","大華里","大和里","大榮里","大義里","陸光里","大昌里","大發里","大安里","大智里","瑞祥里","大湳里","瑞豐里","興仁里","大明里","瑞發里","大信里","瑞泰里","大興里","大順里"]);
		Taoyuan_County[i++]=new node("大園區", ["","橫峰里","五權里","沙崙里","海口里","竹圍里","內海里","[果]林里","後厝里","北港里","和平里","三石里","田心里","南港里","大園里","大海里","溪海里","埔心里","圳頭里"]);
		Taoyuan_County[i++]=new node("大溪區", ["","仁義里","永福里","仁愛里","復興里","義和里","僑愛里","中新里","仁文里","一心里","一德里","仁武里","員林里","光明里","田心里","福仁里","興和里","康安里","新峰里","福安里","三元里","瑞興里","仁和里","南興里","月眉里","美華里","仁善里","瑞源里"]);
		Taoyuan_County[i++]=new node("中壢區", ["","福德里","內壢里","興仁里","青埔里","東興里","龍安里","中堅里","興和里","幸福里","新街里","正義里","月眉里","山東里","水尾里","三民里","洽溪里","內定里","內厝里","過嶺里","振興里","普強里","信義里","仁福里","仁美里","明德里","龍興里","華愛里","健行里","仁和里","仁祥里","仁愛里","普慶里","普仁里","普忠里","德義里","普義里","永興里","光明里","自信里","自立里","仁義里","文化里","忠孝里","龍慈里","至善里","龍德里","芝芭里","和平里","永光里","五權里","自強里","莊敬里","成功里","忠福里","興國里","興南里","中央里","五福里","新明里","篤行里","舊明里","石頭里","仁德里","中榮里","中壢里","中建里","自治里","中正里","興平里","金華里","中山里","中興里","後寮里","華勛里","新興里","林森里","龍昌里","龍東里","龍岡里","龍平里","忠義里","永福里","復華里","復興里","中原里"]);
		Taoyuan_County[i++]=new node("平鎮區", ["","北勢里","中正里","忠貞里","北富里","貿易里","華安里","東勢里","龍興里","東社里","北興里","新榮里","平興里","北華里","金陵里","廣仁里","宋屋里","北安里","新勢里","義興里","龍恩里","北貴里","湧豐里","平南里","南勢里","金星里","平安里","雙連里","高雙里","廣興里","復旦里","廣達里","復興里","義民里","新富里","建安里","鎮興里","東安里","新安里","平鎮里","福林里","莊敬里","湧光里","湧安里","山峰里","新英里","新貴里"]);
		Taoyuan_County[i++]=new node("桃園區", ["","龍山里","龍祥里","龍壽里","龍鳳里","中泰里","中德里","福林里","東埔里","西埔里","莊敬里","長德里","寶山里","南門里","中平里","中山里","永安里","龍安里","三民里","中和里","永興里","西門里","北埔里","民生里","寶慶里","中寧里","三元里","中成里","南埔里","慈文里","光興里","長美里","中路里","西湖里","龍岡里","文昌里","東山里","中聖里","福安里","豐林里","文化里","汴洲里","中原里","中信里","文中里","中正里","成功里","東門里","中興里","北門里","信光里","朝陽里","青溪里","大興里","寶安里","瑞慶里","新埔里","會稽里","自強里","明德里","春日里","同安里","中埔里","忠義里","長安里","同德里","大有里","雲林里","文明里","南華里","武陵里","玉山里","泰山里","大林里","大豐里","萬壽里","建國里"]);
		Taoyuan_County[i++]=new node("復興區", ["","三光里","華陵里","高義里","奎輝里","長興里","三民里","霞雲里","澤仁里","羅浮里","義盛里"]);
		Taoyuan_County[i++]=new node("新屋區", ["","頭洲里","清華里","新生里","永興里","笨港里","蚵間里","望間里","後庄里","[慷]榔里","新屋里","九斗里","深圳里","大坡里","社子里","埔頂里","石牌里","永安里","下埔里","下田里","後湖里","石磊里","東明里","赤欄里"]);
		Taoyuan_County[i++]=new node("楊梅區", ["","永平里","青山里","埔心里","光華里","四維里","金龍里","東流里","上湖里","富豐里","富岡里","上田里","大平里","瑞塘里","三湖里","瑞原里","楊梅里","水美里","員本里","雙榮里","豐野里","仁美里","大同里","裕新里","頭湖里","中山里","楊江里","金溪里","瑞溪里","裕成里","三民里","瑞坪里","高榮里","新榮里","秀才里","永寧里","紅梅里","梅新里","高上里","梅溪里","楊明里","高山里"]);
		Taoyuan_County[i++]=new node("龍潭區", ["","百年里","大平里","高平里","三林里","高原里","三水里","上林里","永興里","中山里","龍祥里","中興里","黃唐里","八德里","烏樹林里","烏林里","聖德里","九龍里","北興里","武漢里","東興里","三和里","凌雲里","龍潭里","龍星里","佳安里","中正里","上華里","三坑里","富林里","建林里"]);
		Taoyuan_County[i++]=new node("龜山區", ["","新興里","大湖里","迴龍里","大同里","兔坑里","陸光里","舊路里","楓樹里","山頂里","福源里","幸福里","山福里","新路里","嶺頂里","新嶺里","文化里","大華里","南美里","樂善里","長庚里","龍華里","龍壽里","龜山里","精忠里","山德里","中興里","南上里","大坑里","大崗里","公西里"]);
		Taoyuan_County[i++]=new node("蘆竹區", ["","新莊里","富竹里","山腳里","外社里","興榮里","錦興里","坑子里","南崁里","山鼻里","長興里","錦中里","上竹里","宏竹里","中福里","新興里","福昌里","南榮里","營福里","吉祥里","中興里","大竹里","上興里","蘆竹里","福興里","順興里","南興里","蘆興里","五福里","福祿里","瓦窯里","長壽里","羊稠里","中山里","營盤里","內厝里","海湖里","坑口里"]);
		Taoyuan_County[i++]=new node("觀音區", ["","廣福里","新興里","觀音里","坑尾里","大同里","新坡里","白玉里","崙坪里","藍埔里","富源里","上大里","大堀里","廣興里","金湖里","富林里","草新里","草漯里","樹林里","塔腳里","保障里","三和里","武威里","保生里","大潭里"]);

	var	Hsinchu_County=new Array(); var i=0;
		Hsinchu_County[i++]=new node("");
		Hsinchu_County[i++]=new node("五峰鄉", ["","桃山村","大隘村","花園村","竹林村"]);
		Hsinchu_County[i++]=new node("北埔鄉", ["","外坪村","北埔村","南興村","埔尾村","水[砌]村","南埔村","大林村","大湖村","南坑村"]);
		Hsinchu_County[i++]=new node("尖石鄉", ["","玉峰村","秀巒村","義興村","嘉樂村","新樂村","梅花村","錦屏村"]);
		Hsinchu_County[i++]=new node("竹北市", ["","尚義里","崇義里","大義里","鹿場里","東平里","中興里","隘口里","東海里","竹北里","竹仁里","竹義里","泰和里","新社里","聯興里","麻園里","溪州里","白地里","新港里","大眉里","十興里","新國里","新庄里","北崙里","新崙里","福德里","東興里","北興里","興安里","文化里","中崙里","斗崙里"]);
		Hsinchu_County[i++]=new node("竹東鎮", ["","上[館]里","上坪里","瑞峰里","軟橋里","員崠里","東寧里","大鄉里","東華里","商華里","竹東里","榮樂里","[雞]林里","仁愛里","五豐里","三重里","頭重里","員山里","柯湖里","二重里","中山里","中正里","南華里","榮華里","忠孝里","陸豐里"]);
		Hsinchu_County[i++]=new node("芎林鄉", ["","上山村","文林村","芎林村","五龍村","華龍村","秀湖村","永興村","石潭村","新鳳村","中坑村","水坑村","下山村"]);
		Hsinchu_County[i++]=new node("峨眉鄉", ["","七星村","湖光村","富興村","峨眉村","中盛村","石井村"]);
		Hsinchu_County[i++]=new node("湖口鄉", ["","孝勢村","仁勢村","愛勢村","信勢村","中勢村","德盛村","和興村","長嶺村","長安村","湖口村","湖鏡村","湖南村","波羅村","鳳凰村","鳳山村","中興村","信義村","中正村","東興村","勝利村"]);
		Hsinchu_County[i++]=new node("新埔鎮", ["","內立里","寶石里","文山里","五埔里","四座里","旱坑里","田新里","新埔里","新生里","新民里","上寮里","下寮里","南平里","北平里","巨埔里","照門里","清水里","鹿鳴里","新北里"]);
		Hsinchu_County[i++]=new node("新豐鄉", ["","鳳坑村","上坑村","松柏村","松林村","瑞興村","青埔村","埔和村","新豐村","坡頭村","中崙村","重興村","員山村","忠孝村","山崎村","崎頂村","福興村","後湖村"]);
		Hsinchu_County[i++]=new node("橫山鄉", ["","橫山村","田寮村","南昌村","豐鄉村","豐田村","內灣村","福興村","沙坑村","新興村","大肚村","力行村"]);
		Hsinchu_County[i++]=new node("關西鎮", ["","東興里","西安里","南雄里","北斗里","仁安里","北山里","南山里","東安里","東光里","新富里","金山里","錦山里","玉山里","大同里","石光里","上林里","新力里","南和里","東山里","南新里","東平里"]);
		Hsinchu_County[i++]=new node("寶山鄉", ["","寶斗村","深井村","雙溪村","大崎村","三峰村","新城村","山湖村","寶山村","油田村","雙新村"]);

			
var	Hsinchu_City=new Array(); var i=0;
		Hsinchu_City[i++]=new node("");
		Hsinchu_City[i++]=new node("北區", ["","中雅里","西門里","潛園里","中央里","石坊里","興南里","北門里","大同里","中山里","水田里","文雅里","武陵里","舊港里","港北里","中寮里","海濱里","客雅里","育英里","曲溪里","大鵬里","磐石里","新雅里","湳中里","台溪里","康樂里","南寮里","古賢里","士林里","境福里","舊社里","金竹里","金雅里","金華里","光華里","湳雅里","光田里","福林里","長和里","民富里","中興里","仁德里","新民里","西雅里","崇禮里","南勢里"]);
		Hsinchu_City[i++]=new node("東區", ["","關新里","南門里","福德里","南市里","關帝里","東門里","竹蓮里","寺前里","振興里","三民里","東園里","東勢里","金山里","關東里","明湖里","復中里","錦華里","文華里","復興里","下竹里","公園里","南大里","新興里","新光里","高峰里","建華里","豐功里","武功里","軍功里","立功里","建功里","埔頂里","千甲里","龍山里","新莊里","柴橋里","湖濱里","光鎮里","榮光里","成功里","中正里","育賢里","親仁里","仙水里","科園里","仙宮里","光明里","東山里","頂竹里","綠水里","光復里","水源里","前溪里"]);
		Hsinchu_City[i++]=new node("香山區", ["","美山里","朝山里","南隘里","中隘里","內湖里","大湖里","南港里","鹽水里","海山里","香村里","樹下里","牛埔里","港南里","大庄里","茄苳里","東香里","虎林里","虎山里","香山里","浸水里","頂埔里","頂福里","埔前里","中埔里"]);

	
	var	Miaoli_County=new Array(); var i=0;
		Miaoli_County[i++]=new node("");
		Miaoli_County[i++]=new node("三義鄉", ["","廣盛村","[雙]湖村","[雙]潭村","勝興村","西湖村","龍騰村","鯉魚潭村"]);
		Miaoli_County[i++]=new node("三灣鄉", ["","三灣村","內灣村","銅鏡村","北埔村","大河村","大坪村","永和村","頂寮村"]);
		Miaoli_County[i++]=new node("大湖鄉", ["","富興村","大南村","大寮村","南湖村","義和村","東興村","武榮村","栗林村","新開村","大湖村","明湖村","靜湖村"]);
		Miaoli_County[i++]=new node("公館鄉", ["","館中村","館東村","館南村","大坑村","中義村","玉泉村","石墻村","福基村","福星村","開礦村","福德村","五谷村","玉谷村","鶴岡村","鶴山村","仁安村","尖山村","南河村","北河村"]);
		Miaoli_County[i++]=new node("竹南鎮", ["","竹南里","照南里","正南里","新南里","大厝里","營盤里","聖福里","竹興里","龍鳳里","山佳里","中港里","中華里","中英里","中美里","開元里","海口里","港墘里","公[館]里","大埔里","頂埔里","崎頂里","公義里","佳興里","天文里","龍山里"]);
		Miaoli_County[i++]=new node("西湖鄉", ["","高埔村","下埔村","五湖村","四湖村","金獅村","龍洞村","三湖村","湖東村","二湖村"]);
		Miaoli_County[i++]=new node("卓蘭鎮", ["","中街里","新厝里","上新里","豐田里","西坪里","景山里","老庄里","新榮里","內灣里","苗豐里","坪林里"]);
		Miaoli_County[i++]=new node("南庄鄉", ["","東村","西村","南江村","田美村","南富村","員林村","蓬萊村","東河村","獅山村"]);
		Miaoli_County[i++]=new node("後龍鎮", ["","南龍里","中龍里","北龍里","大庄里","溪洲里","豐富里","校椅里","埔頂里","新民里","復興里","東明里","大山里","灣寶里","海寶里","外埔里","海埔里","秀水里","水尾里","龍津里","龍坑里","福寧里","中和里","南港里"]);
		Miaoli_County[i++]=new node("苑裡鎮", ["","苑東里","苑南里","苑北里","西平里","苑港里","西勢里","海岸里","房裡里","客庄里","中正里","苑坑里","水坡里","新復里","山[腳]里","舊社里","福田里","石鎮里","蕉埔里","社苓里","泰田里","上[館]里","玉田里","南勢里","山柑里","田心里"]);
		Miaoli_County[i++]=new node("苗栗市", ["","中苗里","建功里","青苗里","玉清里","玉華里","維新里","維祥里","綠苗里","高苗里","玉苗里","大同里","新苗里","勝利里","上苗里","北苗里","清華里","嘉盛里","福星里","新川里","文山里","福麗里","新英里","福安里","嘉新里","南勢里","文聖里","水源里","恭敬里"]);
		Miaoli_County[i++]=new node("泰安鄉", ["","八卦村","錦水村","清安村","大興村","中興村","梅園村","象鼻村","士林村"]);
		Miaoli_County[i++]=new node("通霄鎮", ["","五南里","五北里","內湖里","楓樹里","烏眉里","福龍里","福源里","通灣里","新埔里","內島里","白東里","白西里","平安里","平元里","通東里","通西里","梅南里","圳頭里","通南里","城北里","城南里","南和里","福興里","坪頂里"]);
		Miaoli_County[i++]=new node("造橋鄉", ["","造橋村","平興村","豐湖村","大西村","錦水村","大龍村","朝陽村","談文村","龍昇村"]);
		Miaoli_County[i++]=new node("獅潭鄉", ["","百壽村","永興村","新店村","和興村","豐林村","新豐村","竹木村"]);
		Miaoli_County[i++]=new node("銅鑼鄉", ["","福興村","銅鑼村","朝陽村","樟樹村","九湖村","竹森村","中平村","興隆村","盛隆村","新隆村"]);
		Miaoli_County[i++]=new node("頭份市", ["","仁愛里","信義里","和平里","民族里","東庄里","後庄里","山下里","蟠桃里","田寮里","蘆竹里","上興里","下興里","尖山里","尖下里","廣興里","濫坑里","民權里","民生里","建國里","成功里","自強里","合興里","文化里","流東里","珊湖里","斗煥里","新華里","興隆里","上埔里","土牛里","頭份里","忠孝里"]);
		Miaoli_County[i++]=new node("頭屋鄉", ["","頭屋村","象山村","北坑村","獅潭村","曲洞村","飛鳳村","明德村","鳴鳳村"]);


		var	Taichung_City=new Array(); var i=0;
		Taichung_City[i++]=new node("");
		Taichung_City[i++]=new node("大甲區", ["","建興里","朝陽里","大甲里","順天里","孔門里","平安里","庄美里","新美里","岷山里","中山里","南陽里","薰風里","義和里","武陵里","文曲里","武曲里","文武里","奉化里","德化里","江南里","頂店里","太白里","孟春里","幸福里","日南里","龍泉里","西岐里","銅安里","福德里"]);
		Taichung_City[i++]=new node("大安區", ["","南埔里","南庄里","中庄里","龜[殼]里","福興里","東安里","頂安里","永安里","福住里","海墘里","西安里","松雅里"]);
		Taichung_City[i++]=new node("大肚區", ["","中和里","福山里","營埔里","社腳里","大東里","大肚里","永和里","磺溪里","永順里","成功里","山陽里","頂街里","瑞井里","蔗[部]里","自強里","新興里","王田里"]);
		Taichung_City[i++]=new node("大里區", ["","大里里","新里里","樹王里","東興里","祥興里","日新里","西榮里","內新里","東昇里","立仁里","新仁里","大元里","夏田里","仁化里","健民里","塗城里","瑞城里","金城里","東湖里","西湖里","國光里","大明里","永隆里","長榮里","中新里","立德里","仁德里"]);
		Taichung_City[i++]=new node("大雅區", ["","大雅里","員林里","六寶里","秀山里","忠義里","橫山里","三和里","西寶里","二和里","四德里","上雅里","文雅里","雅楓里","大楓里","上楓里"]);
		Taichung_City[i++]=new node("中區", ["","繼光里","大墩里","綠川里","公園里","光復里","柳川里","大誠里","中華里"]);
		Taichung_City[i++]=new node("太平區", ["","太平里","長億里","中平里","中興里","建國里","東平里","宜欣里","中山里","坪林里","光華里","新坪里","新光里","新福里","頭汴里","興隆里","光隆里","德隆里","永成里","永平里","成功里","東和里","中政里","平安里","建興里","新興里","新高里","新吉里","新城里","宜佳里","宜昌里","光明里","豐年里","大興里","勤益里","聖和里","福隆里","永隆里","東汴里","黃竹里"]);
		Taichung_City[i++]=new node("北屯區", ["","大坑里","民德里","松竹里","仁和里","仁美里","四民里","后庄里","同榮里","仁愛里","水湳里","陳平里","新平里","平安里","平順里","平德里","松安里","松茂里","大德里","松強里","松勇里","北興里","三光里","平田里","平和里","東光里","舊社里","水景里","軍功里","和平里","東山里","民政里","[部]子里","北京里","平心里","平福里","松和里","平陽里","平興里","平昌里","三和里","忠平里","北屯里"]);
		Taichung_City[i++]=new node("北區", ["","賴明里","賴興里","中正里","六合里","大湖里","錦平里","建德里","崇德里","賴旺里","明新里","立人里","梅川里","賴福里","光大里","文莊里","五常里","新興里","新北里","樂英里","錦村里","建成里","錦洲里","金華里","金龍里","邱厝里","建興里","頂厝里","賴厝里","賴村里","育德里","淡溝里","中達里","錦祥里","健行里","明德里","長青里"]);
		Taichung_City[i++]=new node("外埔區", ["","永豐里","六分里","三崁里","大同里","水美里","大東里","馬鳴里","中山里","鐵山里","土城里","[部]子里"]);
		Taichung_City[i++]=new node("石岡區", ["","石岡里","萬安里","九房里","金星里","龍興里","萬興里","梅子里","土牛里","德興里","和盛里"]);
		Taichung_City[i++]=new node("后里區", ["","泰安里","公館里","月眉里","義德里","廣福里","仁里里","義里里","后里里","厚里里","墩東里","墩西里","墩南里","墩北里","中和里","舊社里","聯合里","太平里","眉山里"]);
		Taichung_City[i++]=new node("西屯區", ["","西安里","西墩里","潮洋里","龍潭里","惠來里","上石里","逢甲里","鵬程里","何安里","何厝里","大河里","大石里","大福里","何德里","何源里","西平里","何南里","至善里","上安里","上德里","逢福里","何明里","何成里","何福里","福和里","福中里","福恩里","福聯里","福瑞里","福林里","福雅里","大鵬里","港尾里","廣福里","林厝里","永安里","福安里","協和里","何仁里"]);
		Taichung_City[i++]=new node("西區", ["","民生里","利民里","三民里","東昇里","廣民里","平和里","公民里","藍興里","公[館]里","和龍里","後龍里","安龍里","吉龍里","昇平里","忠明里","公正里","土庫里","忠誠里","公益里","中興里","公平里","公德里","[雙]龍里","大忠里","民龍里"]);
		Taichung_City[i++]=new node("沙鹿區", ["","居仁里","洛泉里","沙鹿里","美仁里","興仁里","斗抵里","鹿峰里","鹿寮里","竹林里","犁分里","北勢里","福興里","晉江里","六路里","南勢里","埔子里","公明里","清泉里","西勢里","興安里","三鹿里"]);
		Taichung_City[i++]=new node("和平區", ["","南勢里","中坑里","自由里","達觀里","梨山里","平等里","博愛里","天輪里"]);
		Taichung_City[i++]=new node("東區", ["","新庄里","振興里","東橋里","東興里","干城里","泉源里","旱溪里","樂成里","東門里","十甲里","東南里","東勢里","合作里","富台里","富仁里","東信里","東英里"]);
		Taichung_City[i++]=new node("東勢區", ["","北興里","中寧里","東安里","南平里","延平里","上新里","廣興里","泰昌里","中嵙里","福隆里","隆興里","新盛里","詒福里","上城里","下城里","慶東里","慶福里","東新里","粵寧里","下新里","興隆里","茂興里","泰興里","埤頭里","明正里"]);
		Taichung_City[i++]=new node("南屯區", ["","南屯里","豐樂里","楓樹里","中和里","春安里","文山里","新生里","永定里","三厝里","溝墘里","田心里","黎明里","鎮平里","大同里","文心里","同心里","向心里","大誠里","大興里","大業里","惠中里","寶山里","三和里","三義里","春社里"]);
		Taichung_City[i++]=new node("南區", ["","城隍里","國光里","南門里","德義里","積善里","江川里","新榮里","福興里","福平里","和平里","永興里","樹義里","樹德里","西川里","長春里","長榮里","福順里","平和里","南和里","永和里","工學里","崇倫里"]);
		Taichung_City[i++]=new node("烏日區", ["","烏日里","湖日里","三和里","榮泉里","九德里","仁德里","前竹里","五光里","光明里","東園里","溪埧里","北里里","南里里","溪尾里","學田里","螺潭里"]);
		Taichung_City[i++]=new node("神岡區", ["","神岡里","庄前里","北庄里","庄後里","社口里","社南里","三角里","岸裡里","大社里","豐洲里","神洲里","溪洲里","圳前里","新庄里","圳堵里","山皮里"]);
		Taichung_City[i++]=new node("梧棲區", ["","下寮里","中正里","中和里","文化里","安仁里","草湳里","福德里","大庄里","大村里","興農里","永寧里","永安里","頂寮里","南簡里"]);
		Taichung_City[i++]=new node("清水區", ["","鰲峰里","靈泉里","清水里","文昌里","南寧里","西寧里","北寧里","中興里","西社里","南社里","裕嘉里","臨江里","秀水里","武鹿里","海濱里","中社里","高西里","高南里","高東里","高北里","高美里","國姓里","菁埔里","頂湳里","田寮里","橋頭里","下湳里","東山里","楊厝里","海風里","吳厝里","[慷]榔里"]);
		Taichung_City[i++]=new node("新社區", ["","新社里","復盛里","中正里","月湖里","崑山里","大南里","永源里","中興里","協成里","東興里","慶西里","中和里","福興里"]);
		Taichung_City[i++]=new node("潭子區", ["","新田里","聚興里","頭家東里","家興里","家福里","潭陽里","潭秀里","潭北里","福仁里","頭家里","甘蔗里","東寶里","大富里","大豐里","栗林里","嘉仁里"]);
		Taichung_City[i++]=new node("龍井區", ["","竹坑里","龍東里","龍西里","田中里","福田里","麗水里","龍津里","三德里","忠和里","山腳里","龍泉里","龍崗里","新庄里","南寮里","新東里","東海里"]);
		Taichung_City[i++]=new node("豐原區", ["","豐原里","頂街里","中山里","豐榮里","下街里","富春里","葫蘆里","豐西里","西安里","西勢里","東勢里","民生里","大湳里","北湳里","東湳里","西湳里","圳寮里","豐圳里","社皮里","三村里","中興里","田心里","豐田里","鎌村里","南陽里","陽明里","北陽里","中陽里","東陽里","南村里","南田里","南嵩里","翁明里","翁子里","翁社里","朴子里"]);
		Taichung_City[i++]=new node("霧峰區", ["","吉峰里","甲寅里","本鄉里","中正里","錦榮里","萊園里","本堂里","北柳里","南柳里","四德里","五福里","六股里","丁台里","北勢里","南勢里","桐林里","坑口里","峰谷里","萬豐里","舊正里"]);



	var	Changhua_County=new Array(); var i=0;
		Changhua_County[i++]=new node("");
		Changhua_County[i++]=new node("二水鄉", ["","合興村","修仁村","裕民村","聖化村","二水村","源泉村","文化村","光化村","大園村","五伯村","倡和村","惠民村","過圳村","上豊村","十五村","復興村","合和村"]);
		Changhua_County[i++]=new node("二林鎮", ["","外竹里","廣興里","香田里","東華里","復豐里","興華里","東興里","南光里","中西里","西平里","原斗里","東和里","後厝里","西斗里","豐田里","北平里","大永里","東勢里","萬合里","梅芳里","頂厝里","華崙里","趙甲里","永興里","萬興里","振興里","西庄里"]);
		Changhua_County[i++]=new node("大村鄉", ["","新興村","美港村","擺塘村","南勢村","大崙村","貢旗村","村上村","黃厝村","過溝村","加錫村","大村村","福興村","田洋村","大橋村","平和村","茄苳村"]);
		Changhua_County[i++]=new node("大城鄉", ["","山腳村","頂庄村","潭墘村","公館村","東城村","永和村","西城村","大城村","東港村","菜寮村","上山村","臺西村","西港村","豐美村","三豐村"]);
		Changhua_County[i++]=new node("北斗鎮", ["","新生里","大新里","重慶里","五權里","七星里","西德里","東光里","居仁里","西安里","新政里","中和里","光復里","文昌里","大道里","中寮里"]);
		Changhua_County[i++]=new node("永靖鄉", ["","五福村","新莊村","崙美村","浮圳村","湳港村","港西村","永南村","永東村","獨鰲村","敦厚村","永西村","東寧村","同安村","福興村","光雲村","四芳村","永興村","同仁村","瑚璉村","永北村","竹子村","湳墘村","五汴村","崙子村"]);
		Changhua_County[i++]=new node("田中鎮", ["","大崙里","三安里","香山里","沙崙里","新民里","碧峰里","南路里","新庄里","中路里","東路里","東源里","西路里","北路里","梅州里","復興里","三民里","頂潭里","龍潭里","中潭里","三光里","平和里","大社里"]);
		Changhua_County[i++]=new node("田尾鄉", ["","睦宜村","福田村","饒平村","南曾村","新生村","南鎮村","正義村","溪頂村","北曾村","新興村","田尾村","新厝村","北鎮村","溪畔村","豐田村","打簾村","仁里村","柳鳳村","陸豐村","海豐村"]);
		Changhua_County[i++]=new node("竹塘鄉", ["","田頭村","溪墘村","內新村","新廣村","土庫村","樹腳村","永安村","長安村","竹塘村","竹林村","竹元村","五庄村","小西村","民靖村"]);
		Changhua_County[i++]=new node("伸港鄉", ["","埤墘村","泉州村","汴頭村","七嘉村","新港村","泉厝村","大同村","定興村","蚵寮村","曾家村","溪底村","什股村","海尾村","全興村"]);
		Changhua_County[i++]=new node("秀水鄉", ["","下崙村","陝西村","金陵村","金興村","曾厝村","埔崙村","莊雅村","福安村","秀水村","安東村","安溪村","鶴鳴村","義興村","馬興村"]);
		Changhua_County[i++]=new node("和美鎮", ["","鎮平里","南佃里","源埤里","嘉犁里","詔安里","新庄里","雅溝里","大霞里","鐵山里","山犁里","犁盛里","仁愛里","糖友里","和南里","和東里","面前里","和西里","和北里","柑井里","中寮里","竹營里","四張里","中圍里","還社里","竹園里","頭前里","月眉里","塗厝里","好修里","嘉寶里","地潭里","湖內里"]);
		Changhua_County[i++]=new node("社頭鄉", ["","里仁村","埤斗村","美雅村","崙雅村","清水村","仁雅村","舊社村","山湖村","東興村","廣興村","張厝村","朝興村","社頭村","仁和村","松竹村","廣福村","平和村","泰安村","湳底村","龍井村","橋頭村","湳雅村","協和村","新厝村"]);
		Changhua_County[i++]=new node("芬園鄉", ["","大竹村","溪頭村","圳墘村","中崙村","同安村","縣庄村","進芬村","芬園村","社口村","楓坑村","竹林村","大埔村","嘉興村","茄荖村","舊社村"]);
		Changhua_County[i++]=new node("花壇鄉", ["","長春村","三春村","中庄村","永春村","金墩村","劉厝村","花壇村","灣雅村","橋頭村","崙雅村","南口村","長沙村","中口村","文德村","灣東村","白沙村","北口村","岩竹村"]);
		Changhua_County[i++]=new node("芳苑鄉", ["","三成村","福榮村","路上村","路平村","頂[部]村","仁愛村","後寮村","三合村","新街村","信義村","芳中村","五俊村","芳苑村","文津村","興仁村","民生村","草湖村","博愛村","永興村","和平村","建平村","崙腳村","王功村","新生村","新寶村","漢寶村"]);
		Changhua_County[i++]=new node("員林市", ["","大明里","林厝里","中央里","溝皂里","出水里","大饒里","崙雅里","萬年里","惠來里","黎明里","民生里","三義里","東和里","忠孝里","振興里","湖水里","中山里","光明里","中正里","仁愛里","三條里","新興里","新生里","仁美里","浮圳里","三和里","鎮興里","大[峰]里","三信里","和平里","南興里","南平里","源潭里","三橋里","三多里","三愛里","南東里","西東里","大埔里","中東里","東北里"]);
		Changhua_County[i++]=new node("埔心鄉", ["","仁里村","太平村","羅厝村","新[館]村","大華村","南[館]村","瓦南村","經口村","東門村","義民村","瓦中村","埔心村","瓦北村","舊[館]村","芎蕉村","二重村","梧鳳村","油車村","埤霞村","埤[腳]村"]);
		Changhua_County[i++]=new node("埔鹽鄉", ["","打廉村","天盛村","三省村","豐澤村","角樹村","崑崙村","太平村","埔南村","南港村","南新村","新水村","石埤村","出水村","埔鹽村","永樂村","西湖村","[部]子村","好修村","瓦[瑤]村","大有村","新興村","永平村"]);
		Changhua_County[i++]=new node("埤頭鄉", ["","庄內村","中和村","竹圍村","陸嘉村","新庄村","大湖村","元埔村","芙朝村","崙腳村","平原村","合興村","和豊村","永豊村","埤頭村","崙子村","興農村","豊崙村"]);
		Changhua_County[i++]=new node("鹿港鎮", ["","街尾里","菜園里","龍山里","興化里","長興里","泰興里","大有里","中興里","洛津里","景福里","新宮里","順興里","永安里","玉順里","郭厝里","東崎里","頂厝里","埔崙里","東石里","溝墘里","廖厝里","詔安里","海埔里","頂番里","洋厝里","頭崙里","頭南里","草中里","山崙里"]);
		Changhua_County[i++]=new node("溪州鄉", ["","潮洋村","張厝村","菜公村","柑園村","三條村","三圳村","水尾村","榮光村","大庄村","成功村","西畔村","溪州村","溪厝村","圳寮村","東州村","坑厝村","舊眉村","瓦厝村","尾厝村"]);
		Changhua_County[i++]=new node("溪湖鎮", ["","西勢里","媽厝里","番婆里","湳底里","大庭里","忠覺里","頂庄里","大竹里","西溪里","汴頭里","田中里","平和里","湖西里","東溪里","光華里","光平里","河東里","北勢里","太平里","大突里","中山里","中竹里","湖東里","東寮里","西寮里"]);
		Changhua_County[i++]=new node("彰化市", ["","石牌里","南美里","延和里","南安里","莿桐里","南興里","向陽里","延平里","福田里","建寶里","南[瑤]里","東芳里","光南里","成功里","介壽里","彰安里","崙平里","華陽里","福安里","華北里","西安里","台鳳里","永生里","平和里","桃源里","民權里","快官里","東興里","富貴里","大同里","中央里","萬壽里","卦山里","光華里","永福里","西興里","安溪里","中山里","竹巷里","光復里","信義里","龍山里","中正里","長樂里","西勢里","文化里","復興里","陽明里","興北里","民生里","忠孝里","牛埔里","忠權里","新華里","萬安里","磚[瑤]里","福山里","大竹里","香山里","竹中里","五權里","和調里","中庄里","新興里","下[部]里","古夷里","阿夷里","茄南里","田中里","三村里","國聖里","寶[部]里","茄苳里"]);
		Changhua_County[i++]=new node("福興鄉", ["","三和村","萬豐村","外中村","鎮平村","三汴村","元中村","番社村","麥厝村","廈粘村","同安村","頂粘村","秀厝村","外埔村","社尾村","福南村","西勢村","番婆村","橋頭村","大崙村","福寶村","二港村","福興村"]);
		Changhua_County[i++]=new node("線西鄉", ["","下犁村","頂犁村","塭仔村","德興村","溝內村","寓埔村","線西村","頂庄村"]);
		
	var	Nantou_County=new Array(); var i=0;
		Nantou_County[i++]=new node("中寮鄉", ["","八仙村","永平村","復興村","中寮村","廣福村","爽文村","福盛村","和興村","清水村","內城村","龍安村","龍岩村","永芳村","永和村","義和村","永福村","廣興村","崁頂村"]);
		Nantou_County[i++]=new node("仁愛鄉", ["","親愛村","都達村","合作村","大同村","榮興村","互助村","中正村","南豐村","萬豐村","新生村","精英村","力行村","春陽村","法治村","翠華村","發祥村"]);
		Nantou_County[i++]=new node("水里鄉", ["","鉅工村","郡坑村","上安村","民和村","車埕村","南光村","北埔村","農富村","中央村","城中村","新城村","水里村","興隆村","永興村","玉峰村","新山村","新興村","永豐村","頂崁村"]);
		Nantou_County[i++]=new node("名間鄉", ["","東湖村","大坑村","新厝村","新光村","萬丹村","仁和村","新民村","赤水村","竹圍村","三崙村","炭寮村","松山村","松柏村","新街村","田仔村","大庄村","[部]下村","南雅村","中正村","埔中村","崁腳村","濁水村","中山村"]);
		Nantou_County[i++]=new node("竹山鎮", ["","延平里","桂林里","延和里","田子里","福興里","坪頂里","秀林里","延祥里","[回][瑤]里","中山里","中正里","竹山里","雲林里","延山里","中和里","延正里","山崇里","社寮里","中央里","富州里","大鞍里","瑞竹里","桶頭里","鯉魚里","德興里","中崎里","竹圍里","下坪里"]);
		Nantou_County[i++]=new node("信義鄉", ["","人和村","地利村","雙龍村","潭南村","豐丘村","明德村","愛國村","東埔村","自強村","新鄉村","羅娜村","同富村","神木村","望美村"]);
		Nantou_County[i++]=new node("南投市", ["","龍泉里","康壽里","三民里","仁和里","南投里","彰仁里","漳興里","漳和里","軍功里","平和里","三和里","嘉和里","嘉興里","崇文里","三興里","平山里","永豐里","新興里","內興里","內新里","東山里","振興里","千秋里","光華里","光榮里","光明里","永興里","福山里","鳳鳴里","鳳山里","福興里","營南里","光輝里","營北里"]);
		Nantou_County[i++]=new node("埔里鎮", ["","福興里","蜈蚣里","合成里","南門里","珠格里","桃米里","成功里","南村里","向善里","廣成里","史港里","牛眠里","北梅里","薰化里","籃城里","溪南里","愛蘭里","一新里","水頭里","同聲里","杷城里","東門里","枇杷里","泰安里","清新里","大城里","北門里","西門里","大湳里","北安里","鐵山里","房里里","麒麟里"]);
		Nantou_County[i++]=new node("草屯鎮", ["","玉峰里","和平里","上林里","南埔里","土城里","中山里","復興里","碧洲里","山腳里","新厝里","富寮里","炎峰里","敦和里","北投里","碧峰里","中正里","明正里","御史里","中原里","石川里","新庄里","新豐里","加老里","雙冬里","坪頂里","平林里","北勢里"]);
		Nantou_County[i++]=new node("國姓鄉", ["","北港村","石門村","北山村","南港村","國姓村","大旗村","長流村","大石村","柑林村","福龜村","乾溝村","長福村","長豐村"]);
		Nantou_County[i++]=new node("魚池鄉", ["","新城村","東光村","共和村","大雁村","五城村","水社村","頭社村","武登村","日月村","中明村","大林村","東池村","魚池村"]);
		Nantou_County[i++]=new node("鹿谷鄉", ["","彰雅村","廣興村","鹿谷村","初鄉村","鳳凰村","永隆村","秀峰村","清水村","瑞田村","竹豐村","竹林村","和雅村","內湖村"]);
		Nantou_County[i++]=new node("集集鎮", ["","玉映里","富山里","廣明里","永昌里","八張里","吳厝里","集集里","和平里","林尾里","田寮里","隘寮里"]);

	
	var	Yunlin_County=new Array(); var i=0;
		Yunlin_County[i++]=new node("");
		Yunlin_County[i++]=new node("二崙鄉", ["","崙西村","大義村","油車村","庄西村","大同村","復興村","來惠村","三和村","湳仔村","田尾村","崙東村","定安村","永定村","大華村","義庄村","楊賢村","港後村","大庄村"]);
		Yunlin_County[i++]=new node("口湖鄉", ["","湖東村","口湖村","頂湖村","蚵寮村","青蚶村","成龍村","梧北村","梧南村","港東村","港西村","謝厝村","過港村","後厝村","水井村","台子村","崙中村","下崙村","崙東村","埔北村","埔南村","湖口村"]);
		Yunlin_County[i++]=new node("土庫鎮", ["","忠正里","順天里","興新里","宮北里","石廟里","東平里","南平里","西平里","北平里","新庄里","溪邊里","越港里","奮起里","大荖里","後埔里","埤腳里","崙內里"]);
		Yunlin_County[i++]=new node("大埤鄉", ["","吉田村","怡然村","北鎮村","西鎮村","興安村","松竹村","大德村","嘉興村","尚義村","豐田村","三結村","豐岡村","聯美村","南和村","北和村"]);
		Yunlin_County[i++]=new node("元長鄉", ["","長南村","長北村","客厝村","龍岩村","內寮村","山內村","鹿北村","子茂村","後湖村","潭東村","卓運村","頂寮村","下寮村","西莊村","鹿南村","崙仔村","新吉村","瓦[瑤]村","合和村","五塊村","潭西村"]);
		Yunlin_County[i++]=new node("斗六市", ["","仁愛里","信義里","光興里","鎮北里","龍潭里","鎮南里","林頭里","社口里","公誠里","成功里","四維里","中和里","榴南里","公正里","太平里","鎮西里","忠孝里","榴中里","榴北里","長安里","久安里","長平里","湖山里","梅林里","嘉東里","重光里","崙[峰]里","溝埧里","江厝里","三光里","明德里","三平里","虎溪里","保庄里","八德里","鎮東里","十三里","溪洲里"]);
		Yunlin_County[i++]=new node("斗南鎮", ["","東仁里","南昌里","北銘里","中天里","西岐里","明昌里","大東里","林子里","靖興里","新光里","小東里","阿丹里","將軍里","東明里","田頭里","西伯里","埤麻里","石溪里","舊社里","石龜里","新南里","新崙里"]);
		Yunlin_County[i++]=new node("水林鄉", ["","[舊]埔村","水北村","水南村","海埔村","春埔村","萬興村","尖山村","大山村","蕃薯村","灣東村","灣西村","後寮村","山腳村","西井村","車港村","蘇秦村","大溝村","順興村","塭底村","溪墘村","土厝村","松北村","松中村","松西村"]);
		Yunlin_County[i++]=new node("北港鎮", ["","東華里","義民里","西勢里","賜福里","華勝里","劉厝里","新厝里","東陽里","光民里","仁和里","共榮里","中和里","仁安里","光復里","樹腳里","新街里","大同里","府番里","草湖里","溝皂里","番溝里","大北里","好收里","水埔里","扶朝里","後溝里","公[館]里","南安里"]);
		Yunlin_County[i++]=new node("古坑鄉", ["","樟湖村","草嶺村","古坑村","朝陽村","西平村","永光村","永昌村","東和村","高林村","棋盤村","新庄村","荷苞村","水碓村","田心村","湳仔村","麻園村","桂林村","華山村","華南村","崁腳村"]);
		Yunlin_County[i++]=new node("四湖鄉", ["","四湖村","飛沙村","羊調村","飛東村","鹿場村","蔡厝村","林厝村","崙北村","崙南村","廣溝村","三姓村","內湖村","湖寮村","溪底村","新庄村","湖西村","施湖村","溪尾村","林東村","[柏]東村","[柏]子村"]);
		Yunlin_County[i++]=new node("西螺鎮", ["","振興里","漢光里","廣興里","頂湳里","七座里","廣福里","正興里","大新里","鹿場里","東興里","埤頭里","吳厝里","九隆里","下湳里","福田里","中興里","福興里","中和里","大園里","公[館]里","永安里","光華里","新安里","新豐里","安定里","詔安里","河南里"]);
		Yunlin_County[i++]=new node("東勢鄉", ["","東南村","東北村","昌南村","月眉村","龍潭村","安南村","四美村","新坤村","同安村","程海村","復興村","嘉隆村"]);
		Yunlin_County[i++]=new node("林內鄉", ["","林南村","林北村","林中村","烏塗村","坪頂村","林茂村","湖本村","重興村","烏麻村","九芎村"]);
		Yunlin_County[i++]=new node("虎尾鎮", ["","中山里","新興里","東仁里","公安里","德興里","西安里","安慶里","新吉里","北溪里","堀頭里","建國里","立仁里","延平里","穎川里","三合里","芳草里","中溪里","埒內里","惠來里","下溪里","平和里","興南里","安溪里","頂溪里","東屯里","西屯里","興中里","廉使里","墾地里"]);
		Yunlin_County[i++]=new node("崙背鄉", ["","五魁村","舊庄村","南陽村","西榮村","東明村","豐榮村","草湖村","水尾村","枋南村","羅厝村","港尾村","大有村","阿勸村","崙前村"]);
		Yunlin_County[i++]=new node("麥寮鄉", ["","瓦[瑤]村","崙後村","後安村","海豐村","三盛村","麥豐村","麥津村","施厝村","橋頭村","中興村","新吉村","雷厝村","興華村"]);
		Yunlin_County[i++]=new node("莿桐鄉", ["","甘厝村","埔子村","麻園村","四合村","興貴村","五華村","饒平村","義和村","六合村","埔尾村","大美村","甘西村","莿桐村","興桐村"]);
		Yunlin_County[i++]=new node("臺西鄉", ["","海北村","海南村","光華村","永豐村","五港村","台西村","海口村","溪頂村","牛厝村","泉州村","五榔村","山寮村","富琦村","和豐村","蚊港村"]);
		Yunlin_County[i++]=new node("褒忠鄉", ["","埔姜村","田洋村","中民村","馬鳴村","中勝村","潮厝村","有才村","新湖村","龍岩村"]);

		
	var	Chiayi_County=new Array(); var i=0;
		Chiayi_County[i++]=new node("");
		Chiayi_County[i++]=new node("大林鎮", ["","上林里","中坑里","中林里","吉林里","大美里","東林里","西林里","平林里","三和里","明華里","內林里","義和里","大糖里","明和里","溝背里","西結里","過溪里","三角里","三村里","湖北里","排路里"]);
		Chiayi_County[i++]=new node("大埔鄉", ["","茄苳村","大埔村","西興村","永樂村","和平村"]);
		Chiayi_County[i++]=new node("中埔鄉", ["","三層村","中崙村","沄水村","深坑村","瑞豐村","頂埔村","石[弄]村","同仁村","龍門村","中埔村","灣潭村","[鹽][館]村","裕民村","隆興村","和睦村","義仁村","金蘭村","社口村","富收村","和興村","和美村","東興村"]);
		Chiayi_County[i++]=new node("六腳鄉", ["","三義村","雙涵村","港美村","更寮村","工廠村","蒜南村","古林村","溪厝村","蒜東村","蒜頭村","灣南村","六南村","灣北村","塗師村","正義村","潭墘村","崙陽村","蘇厝村","六斗村","豐美村","竹本村","永賢村","魚寮村","六腳村","崩山村"]);
		Chiayi_County[i++]=new node("太保市", ["","梅埔里","春珠里","安仁里","崙頂里","後潭里","前潭里","太保里","東勢里","後庄里","港尾里","埤鄉里","新埤里","南新里","舊埤里","田尾里","麻寮里","過溝里","北新里"]);
		Chiayi_County[i++]=new node("水上鄉", ["","靖和村","三鎮村","南鄉村","溪洲村","龍德村","義興村","中庄村","忠和村","柳新村","水上村","南和村","水頭村","柳林村","三界村","國姓村","內溪村","柳鄉村","民生村","大堀村","回歸村","大崙村","寬士村","粗溪村","塗溝村","三和村","下寮村"]);
		Chiayi_County[i++]=new node("布袋鎮", ["","見龍里","東港里","江山里","菜舖里","新厝里","考試里","振寮里","西安里","東安里","樹林里","龍江里","貴舍里","興中里","岑海里","好美里","中安里","復興里","新民里","新岑里","永安里","岱江里","光復里","九龍里"]);
		Chiayi_County[i++]=new node("民雄鄉", ["","山中村","興南村","福樂村","大崎村","興中村","中央村","[雙]福村","文隆村","北斗村","松山村","平和村","中和村","西昌村","東湖村","中樂村","西安村","東榮村","菁埔村","東興村","福權村","頂崙村","三興村","寮頂村","豊收村","鎮北村","金興村","福興村","秀林村"]);
		Chiayi_County[i++]=new node("朴子市", ["","松華里","梅華里","南竹里","德家里","順安里","新庄里","竹村里","崁前里","崁後里","佳禾里","新寮里","竹圍里","大葛里","文化里","平和里","中正里","永和里","開元里","順天里","博厚里","大鄉里","安福里","內厝里","仁和里","德興里","溪口里","[雙]溪里"]);
		Chiayi_County[i++]=new node("竹崎鄉", ["","昇平村","金獅村","龍山村","竹崎村","和平村","仁壽村","復金村","獅埜村","沙坑村","坑頭村","緞繻村","桃源村","內埔村","白杞村","紫雲村","灣橋村","光華村","塘興村","義隆村","中和村","鹿滿村","文[峰]村","義仁村","義和村"]);
		Chiayi_County[i++]=new node("東石鄉", ["","西崙村","東崙村","塭仔村","東石村","洲仔村","永屯村","猿樹村","港墘村","塭港村","圍潭村","三家村","蔦松村","海埔村","網寮村","掌潭村","龍港村","副瀨村","下揖村","頂揖村","溪下村","型厝村","港口村","鰲鼓村"]);
		Chiayi_County[i++]=new node("阿里山鄉", ["","山美村","里佳村","達邦村","十字村","來吉村","樂野村","茶山村","新美村","中山村","香林村","豐山村","中正村"]);
		Chiayi_County[i++]=new node("梅山鄉", ["","安靖村","太興村","瑞里村","[雙]溪村","大南村","半天村","太平村","永興村","圳南村","梅南村","太和村","瑞[峰]村","碧湖村","龍眼村","圳北村","梅東村","梅北村","過山村"]);
		Chiayi_County[i++]=new node("鹿草鄉", ["","光潭村","碧潭村","施家村","三角村","松竹村","重寮村","後堀村","竹山村","鹿東村","鹿草村","下麻村","西井村","後寮村","豊稠村","下潭村"]);
		Chiayi_County[i++]=new node("番路鄉", ["","草山村","公興村","觸口村","民和村","新福村","番路村","公田村","內甕村","江西村","下坑村","大湖村"]);
		Chiayi_County[i++]=new node("新港鄉", ["","月眉村","月潭村","溪北村","安和村","三間村","中洋村","菜公村","潭大村","宮前村","福德村","宮後村","大興村","大潭村","古民村","西庄村","共和村","海瀛村","中庄村","埤子村","北崙村","南崙村","板頭村","南港村"]);
		Chiayi_County[i++]=new node("溪口鄉", ["","本厝村","美南村","疊溪村","美北村","柳溝村","妙崙村","溪西村","坪頂村","溪東村","游東村","游西村","溪北村","柴林村","林腳村"]);
		Chiayi_County[i++]=new node("義竹鄉", ["","東光村","東榮村","溪洲村","東過村","西過村","官和村","官順村","新富村","六桂村","新店村","仁里村","義竹村","頭竹村","傳芳村","埤前村","平溪村","北華村","岸腳村","五厝村","後鎮村","中平村","龍蛟村"]);
				


	var	Chiayi_City=new Array(); var i=0;
		Chiayi_City[i++]=new node("");	
		Chiayi_City[i++]=new node("西區", ["","湖內里","獅子里","光路里","紅瓦里","福民里","美源里","翠岱里","致遠里","車店里","劉厝里","自強里","垂楊里","培元里","導明里","新西里","育英里","永和里","新富里","磚[瑤]里","書院里","西平里","西榮里","文化里","頭港里","港坪里","福全里","番社里","後驛里","慶安里","國華里","福安里","重興里","竹圍里","北榮里","大溪里","保福里","保生里","新厝里","保安里","湖邊里","香湖里","下埤里","竹村里","北湖里","北新里"]);
		Chiayi_City[i++]=new node("東區", ["","太平里","中山里","王田里","興仁里","芳安里","宣信里","興南里","興村里","興安里","頂寮里","芳草里","安業里","安寮里","豐年里","新開里","朝陽里","短竹里","過溝里","鹿寮里","蘭潭里","民族里","華南里","東興里","中央里","東川里","文雅里","長竹里","北門里","林森里","盧厝里","仁義里","圳頭里","新店里","義教里","頂庄里","中庄里","後庄里","後湖里","荖藤里"]);

		
	var	Tainan_City=new Array(); var i=0;
		Tainan_City[i++]=new node("");
		Tainan_City[i++]=new node("七股區", ["","大寮里","樹林里","竹港里","看坪里","溪南里","七股里","龍山里","中寮里","篤加里","後港里","[鹽]埕里","三股里","城內里","十份里","永吉里","西寮里","頂山里","大潭里","[慷]榔里","義合里","玉成里","竹橋里","大埕里"]);
		Tainan_City[i++]=new node("下營區", ["","開化里","西連里","中營里","茅港里","大埤里","營前里","仁里里","下營里","新興里","宅內里","大屯里","紅厝里","後街里","甲中里","賀建里"]);
		Tainan_City[i++]=new node("大內區", ["","內江里","石城里","大內里","曲溪里","內郭里","石林里","二溪里","石湖里","頭社里","環湖里"]);
		Tainan_City[i++]=new node("山上區", ["","豐德里","平陽里","新莊里","南洲里","山上里","玉[峰]里","明和里"]);
		Tainan_City[i++]=new node("中西區", ["","法華里","仙草里","五妃里","大南里","開山里","進學里","元安里","小西里","郡西里","民生里","萬昌里","銀同里","福安里","永華里","保安里","青年里","民主里","中正里","建國里","三民里","永福里","公正里","大涼里","安海里","水仙里","協進里","赤嵌里","民權里","天后里","普濟里","藥王里","三合里","協和里","文賢里","光賢里","郡王里","西湖里","西賢里"]);
		Tainan_City[i++]=new node("仁德區", ["","中生里","中洲里","二行里","大甲里","保安里","三甲里","田厝里","上崙里","後壁里","成功里","仁和里","仁愛里","新田里","仁義里","仁德里","一甲里","土庫里","太子里"]);
		Tainan_City[i++]=new node("六甲區", ["","七甲里","龍湖里","甲南里","二甲里","六甲里","王爺里","甲東里","大丘里","菁埔里","中社里","水林里","龜港里"]);
		Tainan_City[i++]=new node("北門區", ["","三光里","中樞里","仁里里","玉港里","北門里","永隆里","東壁里","保吉里","鯤江里","錦湖里","永華里","慈安里","雙春里"]);
		Tainan_City[i++]=new node("北區", ["","玉皇里","三德里","五福里","東興里","安民里","裕民里","公園里","仁愛里","中樓里","重興里","和順里","興北里","振興里","大仁里","華興里","勝安里","賢北里","國姓里","力行里","國興里","大山里","文成里","長榮里","大豐里","大道里","光武里","新勝里","延平里","元寶里","六甲里","實踐里","大港里","開元里","正風里","永祥里","正覺里","大和里","小康里","文元里","成德里","成功里","長德里","興南里"]);
		Tainan_City[i++]=new node("左鎮區", ["","二寮里","草山里","岡林里","內庄里","澄山里","左鎮里","睦光里","中正里","光和里","榮和里"]);
		Tainan_City[i++]=new node("永康區", ["","光復里","中華里","成功里","復興里","東灣里","南灣里","勝利里","神洲里","中興里","建國里","崑山里","復國里","大灣里","六合里","三合里","五王里","西灣里","復華里","安康里","西橋里","北灣里","二王里","網寮里","大橋里","甲頂里","西勢里","永康里","尚頂里","新樹里","東橋里","正強里","龍潭里","埔園里","烏竹里","[鹽]行里","[鹽]洲里","蔦松里","王行里","三民里"]);
		Tainan_City[i++]=new node("玉井區", ["","層林里","三埔里","望明里","三和里","沙田里","玉田里","玉井里","竹圍里","中正里","豐里里"]);
		Tainan_City[i++]=new node("白河區", ["","六溪里","崁頭里","大林里","關嶺里","外角里","白河里","河東里","永安里","秀祐里","庄內里","虎山里","仙草里","大竹里","汴頭里","昇安里","竹門里","玉豐里","甘宅里","廣安里","崎內里","詔安里","草店里","蓮潭里","內角里"]);
		Tainan_City[i++]=new node("安平區", ["","文平里","國平里","育平里","漁光里","華平里","怡平里","建平里","億載里","平通里","港仔里","金城里","海頭里","西門里","平安里","石門里"]);
		Tainan_City[i++]=new node("安定區", ["","中沙里","六嘉里","大同里","新吉里","港南里","港口里","中榮里","海寮里","港尾里","南安里","安加里","管寮里","安定里","保西里","蘇厝里","蘇林里"]);
		Tainan_City[i++]=new node("安南區", ["","青草里","長安里","海南里","國安里","溪頂里","海佃里","溪東里","溪北里","溪墘里","安富里","四草里","安西里","大安里","安和里","安東里","理想里","鹿耳里","安慶里","梅花里","[鹽]田里","鳳凰里","頂安里","淵中里","安順里","新順里","總頭里","原佃里","溪心里","顯宮里","淵東里","淵西里","城北里","州南里","布袋里","城南里","東和里","州北里","[塭]南里","城西里","公[塭]里","公親里","砂崙里","學東里","南興里","幸福里","海西里","海東里","佃西里","佃東里","城中里","城東里"]);
		Tainan_City[i++]=new node("西港區", ["","永樂里","新復里","南海里","竹林里","港東里","劉厝里","西港里","慶安里","檨林里","營西里","後營里","金砂里"]);
		Tainan_City[i++]=new node("佳里區", ["","蚶寮里","龍安里","通興里","鎮山里","建南里","忠仁里","東寧里","嘉福里","安西里","頂[部]里","六安里","民安里","子龍里","三協里","海澄里","興化里","佳化里","禮化里","營頂里","溪州里","漳洲里"]);
		Tainan_City[i++]=new node("官田區", ["","渡頭里","拔林里","西庄里","社子里","隆田里","東庄里","官田里","隆本里","大崎里","嘉南里","湖山里","二鎮里","南[部]里"]);
		Tainan_City[i++]=new node("東山區", ["","嶺南里","南勢里","南溪里","青山里","水雲里","林安里","高原里","東河里","科里里","東原里","東中里","聖賢里","大客里","東正里","三榮里","東山里"]);
		Tainan_City[i++]=new node("東區", ["","大智里","崇文里","崇成里","崇明里","大福里","崇德里","大德里","崇學里","和平里","崇善里","路東里","虎尾里","忠孝里","裕聖里","崇信里","德光里","復興里","自強里","文聖里","富裕里","龍山里","關聖里","新東里","富強里","泉南里","東聖里","東安里","大同里","衛國里","裕農里","南聖里","崇誨里","東門里","中西里","東明里","圍下里","東光里","後甲里","莊敬里","小東里","大學里","成大里","德高里","仁和里","東智里"]);
		Tainan_City[i++]=new node("南化區", ["","東和里","南化里","西埔里","中坑里","小崙里","北平里","北寮里","玉山里","關山里"]);
		Tainan_City[i++]=new node("南區", ["","佛壇里","同安里","松安里","永寧里","興農里","省躬里","喜南里","喜東里","喜北里","南都里","南華里","建南里","明興里","郡南里","開南里","白雪里","明亮里","鯤鯓里","大忠里","光明里","府南里","日新里","大林里","荔宅里","國宅里","田寮里","新生里","竹溪里","明德里","大成里","再興里","彰南里","金華里","新興里","文南里","新昌里","廣州里","文華里","大恩里"]);
		Tainan_City[i++]=new node("後壁區", ["","福安里","長安里","頂安里","新東里","烏樹里","竹新里","嘉苳里","仕安里","後壁里","頂長里","平安里","侯伯里","新嘉里","墨林里","後[部]里","菁寮里","土溝里","菁豊里","嘉民里","崁頂里","嘉田里"]);
		Tainan_City[i++]=new node("柳營區", ["","神農里","果毅里","中埕里","八翁里","士林里","光福里","東昇里","大農里","旭山里","人和里","篤農里","重溪里","太康里"]);
		Tainan_City[i++]=new node("將軍區", ["","鯤溟里","長榮里","西華里","西和里","鯤鯓里","忠興里","三吉里","玉山里","將貴里","嘉昌里","保源里","廣山里","將富里","苓和里","北埔里","仁和里","平沙里","長沙里"]);
		Tainan_City[i++]=new node("麻豆區", ["","謝安里","中民里","安業里","安西里","安東里","安正里","磚井里","龍泉里","興農里","中興里","巷口里","[晉]江里","保安里","穀興里","新建里","總榮里","東角里","大埕里","麻口里","油車里","莊禮里","大山里","小埤里","寮[部]里","南勢里","海埔里","埤頭里","港尾里","北勢里"]);
		Tainan_City[i++]=new node("善化區", ["","文昌里","南關里","坐駕里","西關里","小新里","北關里","嘉南里","文正里","東關里","牛庄里","光文里","胡厝里","什乃里","田寮里","嘉北里","胡家里","東昌里","溪美里","東隆里","六分里","六德里"]);
		Tainan_City[i++]=new node("新化區", ["","大坑里","山[腳]里","崙頂里","知義里","武安里","全興里","中央里","東榮里","清水里","竹林里","觀音里","協興里","豐榮里","礁坑里","唪口里","護國里","北勢里","太平里","羊林里","[那]拔里"]);
		Tainan_City[i++]=new node("新市區", ["","大社里","永就里","大洲里","新和里","潭頂里","新市里","港墘里","社內里","大營里","三舍里","豐華里"]);
		Tainan_City[i++]=new node("新營區", ["","姑爺里","角帶里","太南里","南興里","興安里","太北里","永生里","興業里","民榮里","南紙里","民生里","民權里","大宏里","嘉芳里","新南里","中營里","三仙里","延平里","忠政里","王公里","新東里","新北里","土庫里","埤寮里","護鎮里","好平里","鐵線里","五興里","舊[部]里"]);
		Tainan_City[i++]=new node("楠西區", ["","龜丹里","鹿田里","東勢里","楠西里","灣丘里","照興里","密枝里"]);
		Tainan_City[i++]=new node("學甲區", ["","大灣里","豐和里","新榮里","慈福里","仁得里","明宜里","新達里","中洲里","平和里","秀昌里","宅港里","光華里","三慶里"]);
		Tainan_City[i++]=new node("龍崎區", ["","牛埔里","楠坑里","大坪里","龍船里","中坑里","石[曹]里","崎頂里","土崎里"]);
		Tainan_City[i++]=new node("歸仁區", ["","大潭里","武東里","沙崙里","六甲里","崙頂里","看西里","看東里","新厝里","辜厝里","歸南里","許厝里","後市里","歸仁里","文化里","南保里","南興里","八甲里","七甲里","大廟里","媽廟里","西埔里"]);
		Tainan_City[i++]=new node("關廟區", ["","龜洞里","田中里","布袋里","深坑里","五甲里","東勢里","松腳里","南花里","關廟里","香洋里","山西里","北花里","北勢里","新埔里","下湖里","新光里","埤頭里"]);
		Tainan_City[i++]=new node("鹽水區", ["","河南里","南港里","下林里","大豐里","飯店里","竹埔里","田寮里","桐寮里","歡雅里","大莊里","孫厝里","舊營里","後宅里","水仙里","水正里","橋南里","福得里","三生里","中境里","武廟里","義稠里","下中里","水秀里","岸內里","汫水里"]);

		
	var	Kaohsiung_City=new Array(); var i=0;
		Kaohsiung_City[i++]=new node("");
		Kaohsiung_City[i++]=new node("三民區", ["","鼎西里","鼎中里","本和里","本文里","本武里","寶德里","寶泰里","寶興里","寶中里","寶華里","寶國里","寶慶里","寶安里","寶龍里","寶珠里","寶玉里","灣子里","灣愛里","灣中里","灣華里","灣勝里","灣利里","灣復里","正興里","正順里","灣成里","安寧里","安吉里","安和里","達德里","達明里","達仁里","達勇里","同德里","德智里","德仁里","安生里","德東里","德行里","精華里","民享里","安邦里","十全里","十美里","德北里","立誠里","立業里","博愛里","長明里","鳳北里","豐裕里","力行里","鼎盛里","鼎強里","德西里","川東里","裕民里","千秋里","千北里","立德里","千歲里","鳳南里","興德里","建東里","港西里","港東里","港新里","博惠里","安康里","安發里","寶盛里","寶獅里","寶民里","寶業里","本揚里","本上里","本安里","本元里","本館里","鼎金里","鼎力里","鼎泰里","灣興里","安宜里","安泰里","安東里"]);
		Kaohsiung_City[i++]=new node("大社區", ["","翠屏里","觀音里","嘉誠里","保社里","保安里","三奶里","中里里","神農里","大社里"]);
		Kaohsiung_City[i++]=new node("大寮區", ["","拷潭里","內坑里","大寮里","上寮里","三隆里","琉球里","翁園里","前庄里","中庄里","後庄里","義仁里","新厝里","過溪里","潮寮里","會結里","山頂里","忠義里","永芳里","義和里","溪寮里","江山里","昭明里","光武里","中興里","會社里"]);
		Kaohsiung_City[i++]=new node("大樹區", ["","竹寮里","九曲里","久堂里","水安里","檨腳里","興山里","和山里","姑山里","大坑里","井腳里","小坪里","龍目里","大樹里","三和里","溪埔里","興田里","統嶺里","水寮里"]);
		Kaohsiung_City[i++]=new node("小港區", ["","小港里","港正里","港墘里","港南里","港興里","鳳宮里","店鎮里","二苓里","三苓里","順苓里","六苓里","宏亮里","泰山里","山明里","高松里","松山里","坪頂里","孔宅里","廈莊里","合作里","桂林里","鳳鳴里","龍鳳里","松金里","大坪里","鳳興里","鳳源里","鳳林里","鳳森里","正苓里","大苓里","山東里","濟南里","青島里","中厝里","港后里","港明里","港口里"]);
		Kaohsiung_City[i++]=new node("仁武區", ["","仁福里","仁武里","文武里","竹後里","八卦里","後安里","中華里","五和里","仁和里","仁慈里","大灣里","赤山里","考潭里","灣內里","烏林里","高楠里"]);
		Kaohsiung_City[i++]=new node("內門區", ["","石坑里","內門里","內豊里","觀亭里","中埔里","三平里","木柵里","光興里","內興里","溝坪里","金竹里","永富里","永吉里","永興里","內東里","內南里","東埔里","瑞山里"]);
		Kaohsiung_City[i++]=new node("六龜區", ["","新威里","新興里","新寮里","新發里","荖濃里","六龜里","義寶里","興龍里","中興里","寶來里","文武里","大津里"]);
		Kaohsiung_City[i++]=new node("左營區", ["","進學里","尾西里","頂北里","中北里","中南里","廟東里","廟北里","尾南里","屏山里","頂西里","聖后里","聖西里","聖南里","城南里","路東里","[部]北里","[部]南里","埤西里","埤北里","埤東里","果惠里","新光里","光輝里","莒光里","永清里","祥和里","尾北里","福山里","合群里","明建里","崇實里","自助里","海勝里","果貿里","果峰里","菜公里","新下里","新中里","新上里"]);
		Kaohsiung_City[i++]=new node("永安區", ["","永安里","永華里","鹽田里","新港里","保寧里","維新里"]);
		Kaohsiung_City[i++]=new node("田寮區", ["","大同里","崇德里","三和里","鹿埔里","南安里","田寮里","七星里","古亭里","西德里","新興里"]);
		Kaohsiung_City[i++]=new node("甲仙區", ["","和安里","東安里","西安里","大田里","寶隆里","關山里","小林里"]);
		Kaohsiung_City[i++]=new node("杉林區", ["","大愛里","月眉里","杉林里","木梓里","集來里","新庄里","月美里","上平里"]);
		Kaohsiung_City[i++]=new node("那瑪夏區", ["","達卡努瓦里","瑪雅里","南沙魯里"]);
		Kaohsiung_City[i++]=new node("岡山區", ["","平安里","台上里","壽天里","維仁里","後紅里","忠孝里","和平里","協和里","後協里","信義里","仁壽里","碧紅里","福興里","協榮里","壽峰里","仁義里","岡山里","前峰里","本洲里","灣裡里","為隨里","嘉興里","潭底里","嘉峰里","華崗里","三和里","大莊里","竹圍里","程香里","大遼里","劉厝里","白米里","石潭里"]);
		Kaohsiung_City[i++]=new node("林園區", ["","中門里","港埔里","東林里","林園里","頂厝里","王公里","仁愛里","文賢里","廣應里","港嘴里","西溪里","中芸里","鳳芸里","西汕里","東汕里","中汕里","北汕里","五福里","溪州里","潭頭里","林內里","中厝里","林家里","龔厝里"]);
		Kaohsiung_City[i++]=new node("阿蓮區", ["","清蓮里","和蓮里","青旗里","南蓮里","復安里","崗山里","[峰]山里","阿蓮里","中路里","港後里","玉庫里","石安里"]);
		Kaohsiung_City[i++]=new node("前金區", ["","東金里","民生里","社東里","三川里","長城里","北金里","新生里","後金里","林投里","國民里","社西里","博孝里","榮復里","文西里","文東里","長生里","復元里","青山里","長興里","草江里"]);
		Kaohsiung_City[i++]=new node("前鎮區", ["","仁愛里","德昌里","平昌里","興化里","信德里","明道里","興仁里","前鎮里","鎮東里","鎮榮里","鎮昌里","鎮海里","鎮陽里","鎮中里","鎮北里","忠純里","忠誠里","西山里","民權里","建隆里","振興里","良和里","西甲里","盛興里","盛豐里","興中里","興東里","忠孝里","復國里","竹內里","竹東里","竹南里","竹北里","竹西里","竹中里","瑞竹里","瑞豐里","瑞東里","瑞和里","瑞北里","瑞西里","瑞崗里","瑞興里","瑞文里","瑞昌里","信義里","瑞誠里","瑞華里","瑞隆里","瑞平里","瑞祥里","瑞南里","興邦里","平等里","明禮里","明正里","明義里","草衙里","明孝里"]);
		Kaohsiung_City[i++]=new node("美濃區", ["","合和里","祿興里","中壇里","德興里","龍山里","廣德里","東門里","泰安里","瀰濃里","吉東里","福安里","獅山里","龍肚里","興隆里","中圳里","清水里","吉洋里","吉和里","廣林里"]);
		Kaohsiung_City[i++]=new node("苓雅區", ["","福海里","福康里","正心里","五福里","民主里","安祥里","尚義里","林安里","林圍里","晴朗里","和煦里","美田里","朝陽里","博仁里","苓洲里","田西里","人和里","仁政里","苓東里","意誠里","廣澤里","華堂里","日中里","普照里","普天里","林興里","光華里","林華里","林貴里","林榮里","英明里","福隆里","福地里","福居里","福東里","衛武里","正義里","正仁里","建軍里","文昌里","正道里"]);
		Kaohsiung_City[i++]=new node("茂林區", ["","茂林里","萬山里","多納里"]);
		Kaohsiung_City[i++]=new node("茄萣區", ["","和協里","光定里","吉定里","大定里","嘉福里","嘉泰里","嘉樂里","嘉安里","嘉賜里","白雲里","萬福里","福德里","保定里","嘉定里","崎漏里"]);
		Kaohsiung_City[i++]=new node("桃源區", ["","勤和里","桃源里","寶山里","建山里","高中里","復興里","拉芙蘭里","梅山里"]);
		Kaohsiung_City[i++]=new node("梓官區", ["","梓和里","赤東里","茄苳里","梓信里","梓義里","梓平里","大舍里","赤崁里","赤西里","禮蚵里","智蚵里","信蚵里","典寶里","同安里","中崙里"]);
		Kaohsiung_City[i++]=new node("鳥松區", ["","鳥松里","夢裡里","大華里","[帝]埔里","仁美里","大竹里","華美里"]);
		Kaohsiung_City[i++]=new node("湖內區", ["","太爺里","公[館]里","葉厝里","田尾里","海埔里","文賢里","大湖里","湖東里","湖內里","海山里","劉家里","逸賢里","中賢里","忠興里"]);
		Kaohsiung_City[i++]=new node("新興區", ["","德政里","仁聲里","德望里","華聲里","蕉園里","永寧里","興昌里","成功里","黎明里","愛平里","中東里","秋山里","漢民里","東坡里","浩然里","正氣里","振華里","振成里","玉衡里","榮治里","德生里","光耀里","文昌里","順昌里","開平里","南港里","新江里","建華里","建興里","長驛里","明莊里","大明里"]);
		Kaohsiung_City[i++]=new node("楠梓區", ["","東寧里","享平里","惠楠里","錦屏里","玉屏里","金田里","瑞屏里","宏毅里","宏榮里","久昌里","福昌里","泰昌里","興昌里","建昌里","宏昌里","隆昌里","秀昌里","裕昌里","國昌里","加昌里","仁昌里","中興里","大昌里","清豐里","五常里","惠民里","惠豐里","中陽里","稔田里","翠屏里","藍田里","中和里","廣昌里","和昌里","慶昌里","宏南里","盛昌里"]);
		Kaohsiung_City[i++]=new node("路竹區", ["","社西里","竹東里","文南里","鴨寮里","社中里","竹南里","社南里","下坑里","竹園里","社東里","三爺里","北嶺里","後鄉里","新達里","頂寮里","竹滬里","文北里","竹西里","甲南里","甲北里"]);
		Kaohsiung_City[i++]=new node("鼓山區", ["","前峰里","光榮里","忠正里","龍井里","正德里","平和里","民強里","厚生里","裕豐里","鼓岩里","興宗里","新民里","延平里","維生里","惠安里","壽山里","哨船頭里","民族里","寶樹里","樹德里","內惟里","建國里","裕興里","華豐里","明誠里","龍水里","桃源里","麗興里","峰南里","登山里","山下里","光化里","綠川里","河邊里","自強里","雄峰里","鼓峰里","龍子里"]);
		Kaohsiung_City[i++]=new node("旗山區", ["","太平里","大德里","上洲里","瑞吉里","鯤洲里","湄洲里","圓富里","中正里","大林里","新光里","南勝里","中寮里","東平里","東昌里","竹峰里","永和里","三協里","大山里","中洲里","南洲里","廣福里"]);
		Kaohsiung_City[i++]=new node("旗津區", ["","上竹里","中興里","實踐里","中洲里","安順里","南汕里","北汕里","復興里","中華里","慈愛里","振興里","永安里","旗下里"]);
		Kaohsiung_City[i++]=new node("鳳山區", ["","海光里","誠智里","縣口里","成功里","光明里","興中里","南興里","和德里","鳳崗里","鎮北里","縣衙里","文英里","鎮東里","埤頂里","中正里","鎮南里","老爺里","瑞竹里","新興里","忠誠里","新甲里","一甲里","東門里","瑞興里","天興里","鳳東里","新富里","國隆里","文德里","過埤里","曹公里","和興里","協和里","文山里","誠德里","三民里","北門里","富甲里","武松里","文衡里","誠信里","海洋里","新樂里","新泰里","中崙里","中榮里","中民里","二甲里","富榮里","南和里","保安里","生明里","誠義里","國泰里","興仁里","鎮西里","忠義里","國富里","國光里","文華里","文福里","武慶里","武漢里","忠孝里","中和里","新強里","新武里","正義里","龍成里","善美里","福誠里","福祥里","五福里","福興里","大德里","南成里"]);
		Kaohsiung_City[i++]=new node("橋頭區", ["","橋頭里","仕隆里","仕豐里","白樹里","仕和里","德松里","三德里","甲北里","芋寮里","西林里","東林里","筆秀里","中崎里","橋南里","新莊里","甲南里","頂鹽里"]);
		Kaohsiung_City[i++]=new node("燕巢區", ["","安招里","東燕里","南燕里","尖山里","西燕里","瓊林里","角宿里","鳳雄里","橫山里","深水里","金山里"]);
		Kaohsiung_City[i++]=new node("彌陀區", ["","彌壽里","過港里","舊港里","光和里","海尾里","南寮里","漯底里","彌陀里","彌仁里","彌靖里","鹽埕里","文安里"]);
		Kaohsiung_City[i++]=new node("鹽埕區", ["","中山里","新樂里","中原里","河濱里","南端里","港都里","瀨南里","江南里","壽星里","府北里","光明里","育仁里","沙地里","新豐里","新化里","江西里","教仁里","陸橋里","博愛里","慈愛里","藍橋里"]);

		
	var	Pingtung_County=new Array(); var i=0;
		Pingtung_County[i++]=new node("");
		Pingtung_County[i++]=new node("九如鄉", ["","九清村","九塊村","大坵村","玉泉村","洽興村","後庄村","東寧村","耆老村","三塊村","九明村","玉水村"]);
		Pingtung_County[i++]=new node("三地門鄉", ["","安坡村","馬兒村","達來村","德文村","大社村","三地村","賽嘉村","青山村","青葉村","口社村"]);
		Pingtung_County[i++]=new node("內埔鄉", ["","龍潭村","內埔村","和興村","內田村","東寧村","富田村","振豐村","興南村","義亭村","隘寮村","老埤村","水門村","美和村","龍泉村","黎明村","大新村","建興村","中林村","東勢村","東片村","竹圍村","上樹村","豐田村"]);
		Pingtung_County[i++]=new node("竹田鄉", ["","糶糴村","履豐村","頭崙村","永豐村","西勢村","六巷村","大湖村","鳳明村","泗洲村","竹南村","竹田村","二崙村","美崙村","南勢村","福田村"]);
		Pingtung_County[i++]=new node("牡丹鄉", ["","石門村","四林村","牡丹村","旭海村","東源村","高士村"]);
		Pingtung_County[i++]=new node("車城鄉", ["","統埔村","海口村","福興村","福安村","溫泉村","田中村","保力村","新街村","射寮村","後灣村","埔墘村"]);
		Pingtung_County[i++]=new node("里港鄉", ["","玉田村","大平村","永春村","過江村","三[部]村","中和村","瀰力村","載興村","茄苳村","土庫村","鐵店村","春林村","塔樓村","潮厝村"]);
		Pingtung_County[i++]=new node("佳冬鄉", ["","六根村","萬建村","昌隆村","石光村","燄溫村","塭豐村","賴家村","佳冬村","玉光村","豐隆村","大同村","羌園村"]);
		Pingtung_County[i++]=new node("來義鄉", ["","丹林村","古樓村","南和村","來義村","義林村","望嘉村","文樂村"]);
		Pingtung_County[i++]=new node("東港鎮", ["","新勝里","頂中里","興台里","中興里","八德里","東隆里","豐漁里","盛漁里","興漁里","鎮海里","嘉蓮里","共和里","興和里","興農里","興東里","頂新里","東和里","朝安里","南平里","船頭里","下[部]里","大潭里"]);
		Pingtung_County[i++]=new node("枋山鄉", ["","加祿村","善餘村","楓港村","枋山村"]);
		Pingtung_County[i++]=new node("枋寮鄉", ["","枋寮村","新龍村","中寮村","安樂村","天時村","地利村","人和村","保生村","隆山村","內寮村","新開村","玉泉村","大庄村","東海村","太源村"]);
		Pingtung_County[i++]=new node("林邊鄉", ["","中林村","仁和村","光林村","崎[峰]村","水利村","竹林村","鎮安村","林邊村","田厝村","永樂村"]);
		Pingtung_County[i++]=new node("長治鄉", ["","新潭村","潭頭村","復興村","崙上村","德成村","德協村","繁華村","榮華村","繁隆村","德和村","德榮村","香楊村","長興村","進興村","繁昌村","繁榮村"]);
		Pingtung_County[i++]=new node("南州鄉", ["","溪南村","米崙村","壽元村","同安村","南安村","萬華村","七塊村","溪洲村","仁里村","溪北村"]);
		Pingtung_County[i++]=new node("屏東市", ["","武廟里","大同里","端正里","必信里","崇智里","崇禮里","維新里","安樂里","平和里","楠樹里","扶風里","慶春里","金泉里","勝豐里","橋南里","橋北里","豐榮里","頂宅里","厚生里","擇仁里","建國里","萬年里","義勇里","永安里","公館里","凌雲里","安鎮里","大武里","清溪里","興樂里","明正里","太平里","崇武里","民權里","大埔里","大洲里","前進里","鵬程里","新生里","湖南里","歸心里","湖西里","光華里","一心里","瑞光里","長春里","永昌里","永光里","長安里","永順里","豐田里","豐源里","文明里","泰安里","勝利里","溝美里","仁愛里","斯文里","北勢里","華山里","中正里","北興里","和興里","空翔里","崇蘭里","廣興里","潭墘里","大湖里","玉成里","仁義里","海豐里","信和里","頂柳里","大連里","三山里","永城里","光榮里","龍華里","新興里"]);
		Pingtung_County[i++]=new node("恆春鎮", ["","城南里","城北里","城西里","德和里","龍水里","頭溝里","茄湖里","仁壽里","網紗里","山海里","四溝里","山腳里","南灣里","墾丁里","大光里","水泉里","鵝鑾里"]);
		Pingtung_County[i++]=new node("春日鄉", ["","士文村","古華村","春日村","歸崇村","力里村","七佳村"]);
		Pingtung_County[i++]=new node("崁頂鄉", ["","崁頂村","洲子村","圍內村","力社村","北勢村","港東村","越溪村","園寮村"]);
		Pingtung_County[i++]=new node("泰武鄉", ["","平和村","佳興村","泰武村","武潭村","萬安村","佳平村"]);
		Pingtung_County[i++]=new node("琉球鄉", ["","天福村","南福村","大福村","上福村","杉福村","本福村","中福村","漁福村"]);
		Pingtung_County[i++]=new node("高樹鄉", ["","高樹村","長榮村","東興村","源泉村","司馬村","舊庄村","田子村","大埔村","菜寮村","廣福村","廣興村","新豐村","舊寮村","泰山村","南華村","新南村","建興村","東振村","鹽樹村"]);
		Pingtung_County[i++]=new node("新埤鄉", ["","萬隆村","南豐村","打鐵村","建功村","新埤村","箕湖村","餉潭村"]);
		Pingtung_County[i++]=new node("新園鄉", ["","仙吉村","五房村","新園村","鹽埔村","共和村","興龍村","中洲村","內庄村","新東村","港墘村","瓦[瑤]村","田洋村","南龍村","烏龍村","港西村"]);
		Pingtung_County[i++]=new node("獅子鄉", ["","竹坑村","草埔村","丹路村","楓林村","獅子村","內文村","內獅村","南世村"]);
		Pingtung_County[i++]=new node("萬丹鄉", ["","寶厝村","四維村","田厝村","後村村","崙頂村","萬安村","萬全村","上村村","加興村","社口村","社皮村","磚寮村","萬後村","萬惠村","竹林村","廣安村","社上村","萬生村","水泉村","水仙村","興全村","興安村","甘棠村","灣內村","香社村","社中村","新鐘村","新庄村","[廈]南村","[廈]北村"]);
		Pingtung_County[i++]=new node("萬巒鄉", ["","萬和村","五溝村","佳和村","新厝村","成德村","萬金村","赤山村","泗溝村","硫黃村","萬巒村","鹿寮村","萬全村","佳佐村","新置村"]);
		Pingtung_County[i++]=new node("滿州鄉", ["","港仔村","長樂村","[響]林村","滿州村","永靖村","港口村","里德村","九棚村"]);
		Pingtung_County[i++]=new node("瑪家鄉", ["","佳義村","三和村","瑪家村","北葉村","[涼]山村","排灣村"]);
		Pingtung_County[i++]=new node("潮州鎮", ["","新榮里","新生里","光華里","彭城里","三星里","富春里","潮州里","同榮里","蓬萊里","五魁里","三和里","三共里","泗林里","四春里","崙東里","九塊里","興美里","檨子里","永春里","八爺里","光春里"]);
		Pingtung_County[i++]=new node("霧臺鄉", ["","吉露村","好茶村","霧台村","佳暮村","大武村","阿禮村"]);
		Pingtung_County[i++]=new node("麟洛鄉", ["","新田村","麟蹄村","麟趾村","田道村","田心村","田中村","麟頂村"]);
		Pingtung_County[i++]=new node("鹽埔鄉", ["","鹽南村","彭厝村","鹽中村","振興村","久愛村","高朗村","新圍村","新二村","洛陽村","鹽北村","仕絨村","永隆村"]);

	var	Taitung_County=new Array(); var i=0;
		Taitung_County[i++]=new node("");
		Taitung_County[i++]=new node("大武鄉", ["","大竹村","大鳥村","大武村","尚武村","南興村"]);
		Taitung_County[i++]=new node("太麻里鄉", ["","美和村","泰和村","大王村","香蘭村","金崙村","多良村","三和村","北里村","華源村"]);
		Taitung_County[i++]=new node("成功鎮", ["","博愛里","忠孝里","三仙里","三民里","忠智里","忠仁里","和平里","信義里"]);
		Taitung_County[i++]=new node("池上鄉", ["","福文村","慶豐村","大坡村","大埔村","福原村","錦園村","新興村","萬安村","富興村","振興村"]);
		Taitung_County[i++]=new node("卑南鄉", ["","嘉豐村","利吉村","富山村","富源村","明峰村","初鹿村","美農村","賓朗村","泰安村","太平村","利嘉村","溫泉村","東興村"]);
		Taitung_County[i++]=new node("延平鄉", ["","桃源村","武陵村","永康村","鸞山村","紅葉村"]);
		Taitung_County[i++]=new node("東河鄉", ["","北源村","泰源村","東河村","尚德村","隆昌村","興昌村","都蘭村"]);
		Taitung_County[i++]=new node("金峰鄉", ["","新興村","正興村","賓茂村","歷坵村","嘉蘭村"]);
		Taitung_County[i++]=new node("長濱鄉", ["","樟原村","三間村","忠勇村","長濱村","竹湖村","寧埔村"]);
		Taitung_County[i++]=new node("海端鄉", ["","廣原村","霧鹿村","海端村","崁頂村","利稻村","加拿村"]);
		Taitung_County[i++]=new node("鹿野鄉", ["","瑞和村","瑞豐村","瑞源村","永安村","瑞隆村","鹿野村","龍田村"]);
		Taitung_County[i++]=new node("達仁鄉", ["","台[板]村","南田村","森永村","安朔村","新化村","土[板]村"]);
		Taitung_County[i++]=new node("綠島鄉", ["","公[館]村","中寮村","南寮村"]);
		Taitung_County[i++]=new node("臺東市", ["","富岡里","富豐里","岩灣里","南王里","卑南里","南榮里","新生里","民生里","寶桑里","馬蘭里","中心里","自強里","民族里","四維里","中華里","強國里","建國里","民權里","仁愛里","中正里","大同里","成功里","文化里","中山里","復國里","興國里","復興里","鐵花里","新園里","豐田里","豐年里","光明里","豐樂里","永樂里","康樂里","東海里","新興里","豐榮里","豐谷里","豐里里","豐原里","建和里","建興里","建業里","知本里","建農里"]);
		Taitung_County[i++]=new node("關山鎮", ["","德高里","豐泉里","新福里","中福里","里[龍]里","電光里","月眉里"]);
		Taitung_County[i++]=new node("蘭嶼鄉", ["","東清村","朗島村","紅頭村","椰油村"]);


	var	Hualien_County=new Array(); var i=0;
		Hualien_County[i++]=new node("");
		Hualien_County[i++]=new node("玉里鎮", ["","東豐里","觀音里","長良里","樂合里","中城里","國武里","源城里","啟模里","泰昌里","永昌里","大禹里","三民里","松浦里","春日里","德武里"]);
		Hualien_County[i++]=new node("光復鄉", ["","大安村","大華村","大同村","大進村","大富村","大豐村","南富村","大興村","西富村","大全村","北富村","大平村","大馬村","東富村"]);
		Hualien_County[i++]=new node("吉安鄉", ["","慶豐村","永興村","稻香村","南昌村","仁和村","光華村","干城村","仁安村","南華村","東昌村","仁里村","福興村","宜昌村","勝安村","吉安村","北昌村","永安村","太昌村"]);
		Hualien_County[i++]=new node("秀林鄉", ["","和平村","文蘭村","水源村","銅門村","佳民村","景美村","秀林村","崇德村","富世村"]);
		Hualien_County[i++]=new node("卓溪鄉", ["","古風村","卓清村","卓溪村","太平村","立山村","崙山村"]);
		Hualien_County[i++]=new node("花蓮市", ["","民政里","主商里","民樂里","主勤里","民立里","民運里","民族里","主信里","主睦里","國威里","民德里","民治里","主義里","國治里","民享里","民有里","主計里","國華里","國裕里","民孝里","主農里","主和里","主安里","主學里","民主里","主權里","主力里","主工里","民權里","國風里","民生里","國魂里","國安里","國防里","國光里","國富里","民勤里","國聯里","國盛里","國興里","民意里","國慶里","國強里","國福里","民心里"]);
		Hualien_County[i++]=new node("富里鄉", ["","羅山村","永豐村","豐南村","學田村","富南村","富里村","石牌村","明里村","竹田村","新興村","萬寧村","東里村","吳江村"]);
		Hualien_County[i++]=new node("新城鄉", ["","嘉新村","嘉里村","佳林村","大漢村","北埔村","康樂村","順安村","新城村"]);
		Hualien_County[i++]=new node("瑞穗鄉", ["","瑞穗村","瑞美村","舞鶴村","瑞良村","瑞祥村","奇美村","瑞北村","鶴岡村","富民村","富興村","富源村"]);
		Hualien_County[i++]=new node("萬榮鄉", ["","紅葉村","馬遠村","萬榮村","明利村","見晴村","西林村"]);
		Hualien_County[i++]=new node("壽豐鄉", ["","豐裡村","共和村","壽豐村","光榮村","米棧村","溪口村","水璉村","樹湖村","豐坪村","豐山村","月眉村","平和村","志學村","鹽寮村","池南村"]);
		Hualien_County[i++]=new node("鳳林鎮", ["","大榮里","森榮里","長橋里","鳳信里","鳳智里","鳳禮里","鳳仁里","山興里","鳳義里","北林里","南平里","林榮里"]);
		Hualien_County[i++]=new node("豐濱鄉", ["","靜浦村","港口村","豐濱村","新社村","磯崎村"]);


// 縣市類別
	var output=new Array();
	var i=0;
	
	output[i++]=new node("宜蘭縣",Yilan_County);
	output[i++]=new node("基隆市",Keelung_City);
	output[i++]=new node("臺北市",Taipei_City);
	output[i++]=new node("新北市",Xinbai_City);
	output[i++]=new node("桃園市",Taoyuan_County);
	output[i++]=new node("新竹縣",Hsinchu_County);
	output[i++]=new node("新竹市",Hsinchu_City);
	output[i++]=new node("苗栗縣",Miaoli_County);
	output[i++]=new node("臺中市",Taichung_City);
	output[i++]=new node("彰化縣",Changhua_County);
	output[i++]=new node("南投縣",Nantou_County);
	output[i++]=new node("雲林縣",Yunlin_County);
	output[i++]=new node("嘉義縣",Chiayi_County);
	output[i++]=new node("嘉義市",Chiayi_City);
	output[i++]=new node("臺南市",Tainan_City);
	output[i++]=new node("高雄市",Kaohsiung_City);
	output[i++]=new node("屏東縣",Pingtung_County);
	output[i++]=new node("臺東縣",Taitung_County);
	output[i++]=new node("花蓮縣",Hualien_County);
	return(output);
}
city_dataTree=city_dataHierarchy();

// 第三個欄位被更動後的反應動作
function city_onChangeColumn3(){
	document.getElementById("space_city").checked = true;
	city_updatePath();
}

// 第二個欄位被更動後的反應動作
function city_onChangeColumn2(){
   document.getElementById("space_city").checked = true;

	city_index1=document.getElementById("city_column1").selectedIndex;
	city_index2=document.getElementById("city_column2").selectedIndex;
	city_index3=document.getElementById("city_column3").selectedIndex;
	// Create options for column 3
	
	for (i=0;i<city_dataTree[city_index1].child[city_index2].child.length;i++)
		document.getElementById("city_column3").options[i]=new Option(city_dataTree[city_index1].child[city_index2].child[i], city_dataTree[city_index1].child[city_index2].child[i]);

		document.getElementById("city_column3").length=city_dataTree[city_index1].child[city_index2].child.length;
	//updatePath();
}

// 第一個欄位被更動後的反應動作
function city_onChangeColumn1() {
	
	document.getElementById("space_city").checked = true;
	
	city_index1=document.getElementById("city_column1").selectedIndex;	
	city_index2=document.getElementById("city_column2").selectedIndex;
	city_index3=document.getElementById("city_column3").selectedIndex;
	

	// Create options for column 2
	for (i=0;i<city_dataTree[city_index1].child.length;i++)
	document.getElementById("city_column2").options[i]=new Option(city_dataTree[city_index1].child[i].name, city_dataTree[city_index1].child[i].name);	
	document.getElementById("city_column2").options.length=city_dataTree[city_index1].child.length;
	// Clear column 3
	document.getElementById("city_column3").options.length=0;
	//updatePath();
	
}

// 修改所顯示的路徑
function city_updatePath(){


	city_index1=document.getElementById("city_column1").selectedIndex;
	city_index2=document.getElementById("city_column2").selectedIndex;
	city_index3=document.getElementById("city_column3").selectedIndex;
	city_text1=document.getElementById("city_column1").options[city_index1].text;
	city_text2=document.getElementById("city_column2").options[city_index2].text;
	city_text3=document.getElementById("city_column3").options[city_index3].text;
	alert(city_text1+city_text2+city_text3);
	switch(text3)
	{
		case"宜縣DF135":lan_s=121.62971418600;lat=24.65541390100;range=6000; break;
		

	}

	
	//location_point(lat,lan_s,2000,0,0)
	//alert(lan_s);
}